{
  // Note to translators: There should be a comment like // add in 1.X.X at the end of each new line added when updating the mod! Feel free to message me if you have a question regarding translation. Thank you for your hard work! 
  // In this version : some lines have been changed (I added a comment saying //changed in 2.0.0)
  //The name of the keys for his 10 hearts dialogue have been changed (for the platonic, festival & location dialogue) and a romantic version of each of the 10 hearts strings has been added.
  // Disposition
  "RodneyDisplayName": "Rodney",
  "MeredithDisplayName": "Meredith",
  "EdwinaDisplayName": "Edwina",
  "RodneyElliottRelationship": "nephew", //token name changed in 3.0.0
  "RodneyMeredithRelationship": "daughter", //added in 3.0.0
  "RodneyEdwinaRelationship": "nana", //added in 3.0.0
  "MeredithRodneyRelationship": "dad", //added in 3.0.0 
  "MeredithElliottRelationship": "cousin", //added in 3.0.0 
  "MeredithEdwinaRelationship": "nana", //added in 3.0.0
  //DIALOGUE
  "Introduction": "Hello there! Yes, it is I, the famous Rodney O'Brien, winner of not one, but two Best Novel Of The Year Awards from the FernCon! I know you are probably starstruck, but please, refrain from asking for an autograph.$1#$b#...#$b#Oh, you've never heard of me? Well that's a shame. Maybe try to pick up a book once in a while.$7#$b# Anyways. The name's Rodney. I'm Elliott's uncle. I live in East Scarp, in the old silo on the north-east. Pleasure to meet you @!$1",
  "spring_1": "Time's is Spring! The season where everything seems brand new, when the world feels lively again and when pretty flowers start to bloom!$1#$b#What? I like pretty flowers.",
  "spring_Mon": "I spoke to my daughter on the phone last night. When I asked her what she was doing for spring break, she told me she was gonna study.#$b#When I was her age, I spent most spring breaks partying in the Fern Islands.$1#$b#How did I raise such a killjoy?$2",
  "spring_Mon2": "My daughter Meredith will soon graduate! I hope she'll find the time to visit her old man when she does.#$b#I like living here instead of Zuzu City, but I do miss her.$2",
  "spring_Mon4": "Do you know what does the writer suffer from each Spring?#$b#A case of allegories!$1#$e#Get it?",
  "spring_Mon6": "Do you know why some people eat snails?#$b#They don't like fast-food!$1#$e#Get it?",
  "spring_Mon8": "I really like to shop at Pierre's, especially since I have no sympathy towards Joja, but that man needs to lower some of its prices.$2#$b#200 $ for a bottle of vinegar is highway robbery considering you can get a full meal at the saloon like a salad for only 220 $ !$5",
  "spring_Mon10.Platonic": "The Egg Festival reminds me of my childhood. Of course, in Zuzu City, people would celebrate the Egg Festival in their private gardens. There was no city wide Egg Hunt.#$b#We had no garden when I was child, so my parents would hide eggs in every nook and cranny of our tiny apartment. I really loved it.$1",
  "spring_Tue": "I read a few pages of Elliott's first draft for his novel. It's pretty good!$1#$b#He didn't like it, though.$2#$b#He kept asking me to stop reading over his shoulder while he was writing.#$b#I mean, a professional writer offers to give him feedback for free, and he rejects it? That kid is so unappreciative.$5#$b#Who does he think he is to refuse the help of Rodney O'Brien, two-time Award winner of the best novel of the year at FernCon?$1",
  "spring_Tue2": "I've been working on a new writing project, and I'm pretty excited about it.#$b#It's been years since I've felt this productive in regard to my writing.$1",
  "spring_Tue4": "My hand have been hurting for a couple of days so I went to see the Doctor.#$b#Turns out I got tendinitis from writing too much.$1#$b#I hadn't happened in years, I'm so happy!$1#$b#I'm in pain, yes, but it's happy pain, you know?",
  "spring_Tue6": "A writer's life is not a glamorous as most people believe.#$b#For example, last night I spent a couple hours researching laws regarding the zoning of agricultural areas in Stardew Valley.$2#$b#I needed it for a single sentence.$7",
  "spring_Tue8": "$d Joja #I told Pierre that I believed his prices were too high. You know what he said?#$b#'If you don't like it, you can shop elsewhere!'#$b#Does he really want to drive all his customers towards Joja Mart?$2|#I told Pierre that I believed his prices were too high. You know what he said?#$b#'If you don't like it, you can shop elsewhere!'#$b#He knows that Joja Mart is closed, right?$2",
  "spring_Tue10.Platonic": "I've told you I mostly write science fiction, but I did write a fantasy novel once. Even though it's not my favorite genre, I really enjoy it and I thought I could write a compelling story.#$b#I've never been so wrong.$2#$b#After hours of editing, I finally got it published. My publisher suggested that I use a pen name, because my audience was not used to this type of book.#$b#I should have listened to them. This novel received some pretty harsh critiques and I was bestowed the Worst Fantasy Novel of The Decade Award...$2#$b#This was the last time I did something outside of my comfort zone.$2",
  "spring_Wed": "I like to do a tarot spread for each season. I did one this morning to learn more about spring.$3#$q 860605/860606 tarot_followup#Tell me farmer @, do you believe in the power of the Tarot Cards?#$r 860605 10 tarot_yes#Yes! There's magic everywhere in Ferngill and Tarot Cards are no exception.#$r 860606 -20 tarot_no#Not at all. Those cards are just pretty drawing that people like to think have power when they have none.",
  "tarot_yes": "Ah! Great minds think alike !$1",
  "tarot_no": "Oh, I thought you'd be more open-minded, coming from the big city. That's disappointing.$7",
  "tarot_followup": "$p 860605#You're not quite like what I imagined.$1|%Rodney seems sad.",
  "spring_Wed2": "You know @, you remind me of a specific tarot arcana.#$b#The Fool.$3#$b#Oh don't take it the wrong way. It doesn't mean that you're a fool. That actually a common misconception.$4#$b#The Fool represents innocence and a free spirit. It's numbered zero: the number of unlimited potential.$1",
  "spring_Wed4": "I don't wanna brag, but...$4#$e#A few years ago, I was invited to the Queen Of Sauce's annual Garden Party. That's the first time I met her, and she's surprisingly down to Earth for such a famous woman.$1#$e#Gus reminds me of her, a bit. Or maybe, it's just his food.#$e#Great, now I'm hungry. Thank you very much @.$5",
  "spring_Wed6": "Spring in the Valley is so peaceful compared to what it's like in Zuzu City.#$b#In the city, every single park of the city became crowded with depressed office workers, partying students and noisy children every time the Sun would shine for more than thirty minutes.#$b#Ah, good times.$1",
  "spring_Wed8": "On Wednesdays, I wear pink.",
  "spring_Wed10.Platonic": "You know farmer, I never thought I'd say this when you moved here but...#$b#I'm really glad you're my friend.$4#$b#Wow, that was weird.$1",
  "spring_Thu": "Do you just run around town talking to random people instead of taking care of your farm?#$b#You're not a very good farmer, are you?$7",
  "spring_Thu2": "Do you watch Living off the Land? I find it quite fascinating. Not that I plan on living off the land anytime soon, I prefer shopping at Pierre's and eating at the saloon.#$b#But it provides me with some interesting research for my next book!$1",
  "spring_Thu4": "I had a call with my editor last night.#$b#They're not happy that my next book is gonna be mostly fantasy.$2#$b#See @, I usually write science-fiction, and I'm good at it. But, years ago I published a fantasy novel and let's say, it was far from successful.$2",
  "spring_Thu6": "I did a tarot reading last night, trying to figure you out.#$b#I discovered that you love %favorite. That an interesting choice.$3",
  "spring_Thu8": "This morning I did a tarot reading for the book I'm currently working on.$3#$b#It's a good way to define the personality of a character with a bit of magical randomness!$1",
  "spring_Thu10.Platonic": "Hey @, do you know what happens when you don't pay your exorcist?#$b#You get repossessed!$1#$e#Get it?",
  "spring_Fri": "It's kind of weird how quiet life is in the Valley. Back in Zuzu City, everyone seemed in a hurry all the time.#$b#Here, you can enjoy walking at your own pace, stopping to smell the flowers or talk to random people. I think I like it.$1",
  "spring_Fri2": "Spring in the Valley really is a special time, don't you agree @?#$b#It feels like everything fits perfectly together: nature, the people, the sun, the spirits...#$b#I love it.$1",
  "spring_Fri4": "I read online that they're doing a reboot of Stellar Gallivant...$2.#$b#Not gonna lie, I'm scared.$2.#$b#I'll watch every single minute of it, but I swear I'll be pissed the all time!$1",
  "spring_Fri6": "I heard that the producers of Stellar Gallivant heard the complaints of the fans online. Instead of a reboot, they're developing a new show based in the same timeline.#$b#I can't believe that complaining on the Internet actually worked, now I'll have to do it all the time!$1",
  "spring_Fri8": "So. They started airing the new Stellar Gallivant show.#$b#It's set a couple hundred centuries after the previous show. I was a bit skeptical, but it's pretty cool actually.#$b#They even added a character who's originally from the Gotoro Empire. That's a nice touch, especially since Stellar Gallivant has always been about peace and unity.$1",
  "spring_Fri10.Platonic": "Yesterday, I watched a documentary about the Fern Islands and now, I really want to visit again.$2#$b#Last time I went was on spring break when I was a student.#$b#Damn, I'm getting old.$2",
  "spring_Sat4": "I sent a beautifully handwritten letter to my daughter last week, telling her about my life in the Valley.#$b#You know what she did?#$b#She called me and asked me why I used such a primitive way to communicate with her!$5#$b#That hurt my feelings.$2#$b#Oh I'm still gonna write to her, just to piss her off.$1#$b#I'm such a good dad.",
  "spring_Sat6": "Gus asked me the easiest way to burn a thousand calories.#$b#I told him to leave the pizza in the oven!$1#$b#He didn't like it.$2",
  "spring_Sat8": "I was at the library the other day and Gunther asked for advice on a personal matter.#$b#It told him 'Gunther, believe in your shelf'!$1#$b#He didn't laugh.$2",
  "spring_Sat10.Platonic": "While doing research for a new science fiction novel, I started reading a book about anti-gravity.#$b#It was impossible to put down!$1#$e#Get it?",
  "spring_Sun": "I had a breakthrough while working on my novel last night! So, tonight I'll celebrate by doing absolutely nothing.#$b#Isn't that the best feeling?$1",
  "spring_Sun2": "I spent hours writing yesterday.$1#$b#I ended up deleting a few thousand words because they were rubbish.$5#$b#Writing is hard. Don't try this at home.$2",
  "spring_Sun4": "I was talking with Jacob the other day and you know who he reminds me of?#$b#The King Of Pentacles! It's the tarot arcana that represents leadership and discipline.$3",
  "wizard_dialogue_male1": "I went to visit the wizard's tower the other day to ask him about the magic in the Valley. You know, research for my novel.#$b#So I knock on his door, he opens it, takes a look at me and slams the door in my face!$2#$b#He's not very friendly.$5",
  "wizard_dialogue_female1": "I went to visit the witch's tower the other day to ask her about the magic in the Valley. You know, research for my novel.#$b#So I knock on her door, she opens it, takes a look at me and slams the door in my face!$2#$b#She's not very friendly.$5",
  "wizard_dialogue_male2": "Do you know there's a wizard living in that weird looking tower in Cindersap Forest? I might visit him one day.#$b#My Nana told me not to trust wizards, though. Well, not exactly.#$b#She used to tell me, 'Most wizards are either self-absorbed manipulative overachievers or dumb sexy men with a purple beard and a silly hat.'#$b# Now that I think about it, that might have been a strange thing to say to a six years old.$1",
  "wizard_dialogue_female2": "Do you know there's a witch living in that weird looking tower in Cindersap Forest? I might visit her one day.#$b#My Nana told me not to trust other witches, though. Well, not exactly.#$b#She used to tell me, 'Most witches are either self-absorbed manipulative overachievers or dumb sexy women with purple hair and a silly hat.'#$b# Now that I think about it, that might have been a strange thing to say to a six years old.$1",
  "wizard_dialogue_male3": "I've been asking around town about the wizard that lives in the tower in the forest, and you'll never guess what I learned.#$b# Apparently, he has an illegitimate child in town$1!#$b#I can't tell you who told me that.#$b#...#$b#...#$b#...#$b#Okay, it was Gus! Gus told me.#$b#Man, do you have psychic abilities?",
  "wizard_dialogue_female3": "I've been asking around town about the witch that lives in the tower in the forest, and you'll never guess what I learned.#$b# Apparently, she has an illegitimate child in town$1!#$b#I can't tell you who told me that.#$b#...#$b#...#$b#...#$b#Okay, it was Gus! Gus told me.#$b#Man, do you have psychic abilities?",
  "spring_Sun8": "You know Alex, right?#$b#I finally found which tarot arcana suits him best.#$b#He's obviously the Knight of Swords.$3#$b#This arcana is all about being ambitious, action oriented and driven to succeed.$3",
  "spring_Sun10.Platonic": "I really wish my dear Annwenn could have met you.$2#$b#She talked a lot so she would have loved your constant silence!$1",
  "summer_1": "Ah Summer! The season of sweat, scorching heat and humanity's greatest foes.#$e#Mosquitoes!$5#$e#Then again, Summer is also the time for swimming in the clear waters of the Gem Sea, enjoying some freshly grown melon from %farm Farm!$1#$e#Plus, I get to wear shorts, which are way better than regular pants.$1",
  "summer_Mon": "%Rodney looks grumpy.#$b#Oh great. You again.$5#$b#Here, let me pull a tarot card.$3.#$b#It says that... you need to leave me alone.$3",
  "summer_Mon2": "You know what I hate the most about Joja?$5#$b#How I enjoy drinking Joja Cola...$2#$b#I know it's gross and full of chemicals and sugar, but man, I can't get enough of that stuff.",
  "summer_Mon4-1": "Well hello there farmer @.#$b#$y 'If you could leave your farm for a bit, where would you like to spend your Summer vacation?_Sunbathing on a tropical beach._Yeah, that's a good choice.$1_Sightseeing around the world._That a great choice. The world has so much to offer outside of this charming valley.$1'",
  "summer_Mon4-2": "#$b#Personally, I'd like to spend my vacation...at the library!$1#$b#What? I'm a writer. I love books.$7",
  "summer_Mon6": "Hey @! Do you know where cats go when they die?#$b#To purrgatory!$1#$e#Get it?", //purchatoire
  "summer_Mon8": "When I was a teenager, nobody believed I could make it as writer, including myself.#$b#But one day, I heard a quote from a Stellar Gallivant: The Second Genesis.#$b#'Things are only impossible until they are not'.#$b#It stuck with me and it became my personal mantra!$1",
  "summer_Mon10.Platonic": "Abigail is so fun to be around. I love how she keeps talking about eating rocks.#$b#That's why she reminds me so much of the King Of Wands.$3#$b#This tarot arcana is about energy, passion, adventure and impulsiveness. I mean, that's pretty much Abigail!$3",
  "summer_Tue": "Howdy @. I went to the library the other day and Gunther told me you've been helping restore the museum.#$b# I found this in the sand by the tide pools in East Scarp, you want it?[100 116 117]",
  "summer_Tue2": "Have you ever had a conversation with Gunther?#$b#$y 'I mean like an actual conversation, not just dropping artifacts at the counter._Yes, he's an interesting fella._He is, isn't he? I really enjoy talking about the mysteries of the Valley with him $1._No, I don't think I have._Well. You should. He is a kind man, and you should be more polite to him.$5",
  "summer_Tue4": "You know the Governor? The one that shows up only once year to eat all our soup!#$b#If he was a tarot arcana, he'd be The Emperor.$3#$b#It's the card that represents authority. And who has more authority than our elected Governor?$3#$b# Wait, was he elected? I don't recall voting.$2",
  "summer_Tue6": "Harvey is a good doctor but I sometimes feel that he lacks proper besides manner.$2#$b#That's why he reminds me of the Four Of Cups.$3#$b#This arcana is about apathy, contemplation, melancholy and boredom.$3#$b#I really wish he felt happier about his job.$2",
  "summer_Tue8": "Jodi is a gentle soul, don't you think?#$b#She reminds me of the Two Of Cups.$3#$b#This particular tarot arcana is about unity, partnership and close bonds. I feel like she has all that with her family and friends.$3",
  "summer_Tue10.Platonic": "Do you know how my wife Annwenn and I got the idea for Meredith's name?#$b#You'll never guess!$1#$b#My parents thought they were having a daughter and had already chosen the name Meredith for me.$1#$b#They almost named me Meredith but finally settled for Rodney. Naming my daughter Meredith was a nice callback and my parents loved it.$1", //edited in 2.0.0
  "summer_Wed": "On Wednesdays, I wear pink.",
  "summer_Wed2": "Hello @, do you know why writers are really good at coding?#$b#Because they are really into Pro-grammar!$1#$e#Get it?",
  "summer_Wed4": "I just finished reading a great science-fiction novel last night. I really enjoyed it!#$b#But they kept saying 'Solar System' when referring to an alien planetary system. It drives me nuts!$5#$b#If it's not set in our system, it should be called a stellar system! Don't those writers ever do any research?$5#",
  "summer_Wed6": "I started watching the new season of Stellar Gallivant: Uncovering last night.#$b#Man, they decided to move the story forward eight centuries in the future, and they still can't be bothered with the established canon of the show.$5#$b#I mean, how I am supposed to enjoy science fiction is the lore is not consistent?$5",
  "summer_Wed8": "Living in Zuzu City was weird. Everyone was so obsessed with getting the best job, the fanciest car, the biggest apartment...$2#$b#I'm glad I left all that behind to settle in Pelican Town. East Scarp is my little slice of heaven!$1",
  "summer_Wed10.Platonic": "I haven't published much these past fifteen years and I know some people from my old life are worried about it.#$b#I have enough money to live a comfortable life here and I take pride in the fact that the acquisition of wealth is no longer the driving force of my life.$1#$b#I'm happy that I work to better myself and hopefully the rest of humanity.",
  "summer_Thu": "Tell me @, did you hear about the restaurant on the moon?#$b#Great food, no atmosphere!$1#$e#Get it?",
  "summer_Thu2": "I spent the evening at Leah's last night, and we talked about art for hours.#$b#I had a great time!$1#$b#Don't tell Elliott, he's a bit jealous when I hang out with his friends.$2",
  "summer_Thu4": "Do you grow hops on your farm by any chance?#$b#I'd love to drink a freshly brewed pale ale.$1",
  "summer_Thu6": "Have you ever spent some time with Leah?#$b#That girl is amazing. She's like a beacon of creativity. Every time I talk to her, I feel like my inspiration is fueled for a year!$1",
  "summer_Thu8": "Aideen visited the other day, so I offered her some tea.#$b#She had a sip, spit it out and said 'This tea is nothing more than hot leaf juice!'.$2#$b#Then I said 'Aideen, that's what all tea is'.#$b#She got up, took all the tea I had in my kitchen and threw it in the trash.$2#$b#She said she would buy me some proper tea if I promised not to offer her such a disgusting beverage anymore.$2",
  "summer_Thu10.Platonic": "After careful consideration, I've decided which tarot arcana suits Leah the best.$3#$b#She's the Knight of Cups!$3#$b#This arcana is about creativity, charm, beauty and imagination. If fits her personality so well.$3",
  "summer_Fri": "Hello @! How's the farm?#$b#$y 'Are you growing melon?_Yes! A lot of them._Nice! You're sure to fetch a good price for those.$1_No, I need to buy seeds!_Oh! I accidentally bought some the other day, here you go![479]",
  "summer_Fri2": "Do you know the arcana of the High Priestess?$3#$b#Its the card that represents the divine feminine, intuition and spirituality.$3#$b#$y 'Who does that make you think about?_Emily._My thoughts exactly!$3_Caroline._That's an interesting choice. I would have gone with Emily, but I understand what you mean.$3",
  "summer_Fri4": "I tried visiting the local mines, doing research for my book.#$b#This old Marlon guy stopped me before I could even enter and told me that it was too dangerous.#$b#I told him 'If @ can do it, why can't I?'#$b#You know what he said? That adventuring was not a business for an old bookworm like me!$5#$b#He's not a nice man.$2",
  "summer_Fri6": "Summer is such a nice time of the year!$1#$b#I just wish Pelican Town had a nice little seaside coffee shop so I could pretend like I'm writing somewhere else than my own home.",
  "summer_Fri8": "I often find myself thinking about the future. Not just my future, but the future of humanity. Things don't look too bright these days, especially with war raging overseas.$2#$b#Then I think of a quote from Stellar Gallivant: Far Galaxy Ten.#$b#'That might be the most important thing to understand about Humans. It's the unknown that defines our existence. We are constantly searching, not just for answers to our questions, but for new questions.'#$b#Deep stuff, right?$1",
  "summer_Fri10.Platonic": "Hey farmer! Do you now what you call a snowman in Summer?#$b#A puddle!$1#$e#Get it?",
  "summer_Sat": "$d bus#I'm so glad that whatever you did fixed that old bus. Now my daughter has no excuse not to come and visit her old man.$1|I wish that old bus was still in service so my daughter could come and visit me.$2",
  "summer_Sat2": "Are you thirsty on a hot Summer Saturday, farmer @?#$b#Here, take this.$1[90 167 903]#$b#It'll quench ya.",
  "summer_Sat4": "Do you like Pale Ale? I love it, it's the quenchiest!$1",
  "summer_Sat6": "You know, if you grow enough melon on your farm, you could earn quite a lot of money!#$b#People will respect you for it. They'll buy all your melons and you'll become the Melon Lord!$1#$b#Sorry, I got carried away.$4",
  "summer_Sat8": "If you're too hot during the Summer, I heard there's a cave network under East Scarp. The air must be cool down there!$1#$b#Take your sword though. Just in case.",
  "summer_Sat10.Platonic": "You know, I never thought about getting married again.#$b#I know Meredith would be fine with it, she told me herself.#$b#I tried dating a few years back, but it didn't feel right.$2#$b#I know Annwenn would have wanted me to be happy, but truth be told I'm mostly content with my friends. And that's in part thanks to you!$1",
  "summer_Sun": "Why do you keep coming back to me?#$b#I mean, I appreciate the interest, but I can't be that fascinating.#$b#I already told you, I won't sign any autograph.$7#$b#%Rodney stares at you without blinking.",
  "summer_Sun2": "Tell me farmer @...#$b#$y 'Have you ever taken an interest in writing?_Yes, I love writing stories!_Good to hear! I'd love to read some of it if you feel like sharing.$1_No, I don't see the point._Well, that's disappointing. I'm sure you have a lot of stories to tell.$2",
  "summer_Sun4": "Hey @! I'm almost done assigning a tarot arcana to each resident of Pelican Town.$3#$b#$y 'According to you, who should be Judgment?_Mayor Lewis._Really? I was thinking of Haley, but Lewis is also a good fit.$1_Haley._Yes, of course! I mean, she's Judgment incarnate, right?$1",
  "summer_Sun6": "Gunther is such a fount of knowledge. I can spend hours listening to him talk about his findings or the history of the Valley.#$b#That's why I believe he's the perfect incarnation of The Hierophant.$3#$b#This arcana represents spiritual wisdom, conformity and tradition. That's my friend Gunther!$3",
  "summer_Sun8": "That Vincent kid is so fun to be around.#$b#He reminds me of one my favorite tarot arcana.$3#$b#The Sun. It's the arcana associated with positivity, warmth and fun.$3",
  "summer_Sun10.Platonic": "You know farmer @, you did a great job on %farm Farm.#$b#I mean, you left an awful corporate job and turned an abandoned farmland into a thriving farm.#$b#I read somewhere that when we hit our lowest point, we are open to the greatest change.#$b#It made me think of you.$1",
  "fall_1": "And then, came Fall. Dead leaves, dead eyes, dead dreams. And spirits of the dead. It really is the season of death. Oh! I forgot Clint's love life.$2#$e#Was that too mean? Yeah, maybe.#$b#Anyways, it's always a little sad to think that everything around us in going to sleep for the Winter, but Fall colors are THE best colors. I don't even want to hear your opinion about this. I know I'm right.$1",
  "fall_Mon": "Hello there @! How's the farm life treating you?#$b#$y 'Do you have ducks on your farm?_Yes, I have a few._Great! If they ever drop a feather, bring it to me! I adore those.$1_No, ducks are dumb and ugly._Oh! You're dumb and ugly.$5",
  "fall_Mon2": "I wish I had a garden in front of my house.$2#$b#Not that I intend to garden, I just like pretty flowers. If I had a garden, I would just pay Aideen to take care of it for me.$1",
  "fall_Mon4": "As far as I remember, creating stories in my head has always been how I protected myself from the world.#$b#I wasn't very popular as a kid. People thought I was just a nerdy loser who kept talking about spaceships and aliens.$2#$b#I mean, I was!$1#$b#Writing helped me channel my imagination and I'm glad it became my job!",
  "fall_Mon6": "Tell me farmer @, you know Penny, right?$3#$b#$y 'Which tarot arcana do you think suits her the best?_The Sun_Really? I mean, she's not who I would associate with positivity, fun, warmth and success.$3_Temperance_My thoughts exactly! Balance, patience and moderation... that's our dear Penny!$3",
  "fall_Mon8": "The Valley is such a beautiful place.#$b#I really wish I could have enjoyed it with my wife. She never really liked Zuzu City, but she agreed to stay there because it was the right choice for my career.$2#$b#I didn't realize that at the time, of course.",
  "fall_Mon10.Platonic": "You're a really good friend to me @, I hope you know that.$4#$b#When my wife passed away, I shut down from most my friends and my life. I quit writing for years and my only focus was Meredith.$2#$b#For Yoba's sake, she lost her Mom when she was only ten years old. She remembers her, of course, but I know her memories are not as vivid as they used to be. I try my best to make sure our beloved Annwenn is remembered.$2#$b#But the scariest part is that after so many years, her face seems to be fading from my memories...$2#$b#%Rodney wipes away some tears with his hand.#$b#Anyway... It still hurts, but having a good friend like you helps...So thank you @, from the bottom of my heart.$4",
  "fall_Tue": "You know, I think it's nice that you make time to come and talk to me, but I thought running a farm was hard work. Yet, you keep running around town, talking to people.#$b#You're not a very good farmer, aren't you @?$7",
  "fall_Tue2": "Someone told me that I should befriend Jacob since we are both widowers.$2#$b#That's a weird thing to say to someone, but I mean, grief can help people bond.$2#$b#That's sad, but true.$2#$e#%Rodney seems to be holding back tears.",
  "fall_Tue4": "I moved here because Elliott told me how great the place was and how inspiring it was for his writing.#$b#He also included a brochure, put out by Mayor Lewis and when I read it said that Pelican Town was a 'thriving naturist community'.$1#$b#Turns out, it was a typo and Mayor Lewis meant 'thriving natural community'.$2#$b#Still a pretty inspiring place...",
  "fall_Tue6": "My daughter is a traitor.$5#$b#You what her favorite book genre is?#$b#Detective novels!$5#$b#She has a two-time award winning science fiction writer for a father and she loves detective novels!$5#$b#Where did I go wrong with her?$2",
  "fall_Tue8": "It's tarot arcana time!$3#$b#$y 'What's the best arcana for George?_The Chariot!_I see what you did there and that's not nice. Plus, it's inaccurate. The Chariot symbolizes control, willpower, success, and determination. Pretty far from George.$5_The Eight of Swords!_Yes! It fits him pretty well actually. The Eight of Swords symbolizes negative thoughts, self imposed restrictions, imprisonment and victim mentality. That's a bit sad now that I think of it.$2",
  "fall_Tue10.Platonic": "I do my best to be supportive of Elliott's writing, because his parents don't really believe he can make it as writer.$2#$b#He thinks he can do it all alone, and to be honest, he probably can.#$b#While it is always best to believe in oneself, a little help from others can be a great blessing.$1",
  "fall_Wed": "If you ever come across an extra quartz, don't hesitate to bring it to me!#$b#This stone has a lot of energy.$1",
  "fall_Wed2": "On Wednesdays, I wear pink.",
  "fall_Wed4": "Every morning, I have to brush my beard, then apply oil and balm, or else it'll clump into messy knots.#$b#It's a lot of work, but at least I don't have Elliott's hair!$1#$b#He must take forever to get ready in the morning.#$b#That kid's too vain.$2",
  "fall_Wed6": "When Meredith was a child, I tried to teach her about taxes...#$b#So I ate 38% of her candies!$1#$b#She didn't like it, but hey, that was the lesson.",
  "fall_Wed8": "I stopped by Robin's shop the other day to browse her furnitures.#$b#She really has some beautiful stuff to sell!$1#$b#She reminds me of Strength.$3#$b#This tarot arcana is about courage, persuasion, compassion and... well strength of course!$3",
  "fall_Wed10.Platonic": "I don't really get how Elliott is fine with living on a derelict shed on the beach. That kid has such a magnetic personality and yet, he choses to hide from the world.$2#$b#That's why he reminds me of The Hermit.$3#$b#This arcana is perfect to describe someone who enjoys being alone and relies on introspection and inner guidance.$3",
  "fall_Thu": "I did a tarot reading this morning and I got mad at my cards because they kept telling me some truth that I didn't wanna hear.$3#$b#I know tarot is not actual magic, but it feels like it!$1",
  "fall_Thu2": "Oh! Hello @. I didn't see you there.#$b#%Rodney yawns.#$b#Sorry, I stayed up very late. I was writing, and I felt so inspired.#$b#I'm too old to pull an all-nighter.$1.",
  "fall_Thu4": "Hey @! Let's see if you have a firm grasp of the personality of our local shopkeeper Pierre... with tarot cards!$3#$b#$y 'Which tarot arcana would you associate Pierre with?_The Five of Swords_Correct! The Five of Swords is all about conflict, disagreements, competition, and winning at all costs. Classic Pierre!$3_The Seven of Swords_Wrong! The Seven Of Swords is about betrayal, deception and acting strategically. That seems to be closer to that Morris guy from Joja.$3",
  "fall_Thu6": "Once, I met a guru in Zuzu City.#$b#I asked for some wisdom and he told me 'Pants are an illusion, and so is Death.'#$b#I still think about it, especially the part about pants. Deep stuff.$4",
  "fall_Thu8": "Hey @! What do you call a typo on a tombstone?#$b#A grave mistake.$1#$e#Get it?",
  "fall_Thu10.Platonic": "You changed a lot since you arrived in the Valley, @. I'm sure your grandfather would be very proud of what you accomplished on %farm farm.",
  "fall_Fri": "Elliott is a nice kid, but sometimes I fear he doesn't understand how harsh it can be to be a professional writer.$2#$b#It's not just 'write, get published, write another book.'. It's mostly write, edit, delete everything, write again, edit some more, keep editing until a publisher thinks you're worthy of getting published.$2#$b#Oh, I'm not complaining, every job has its drawbacks, but a writer's life isn't as glamourous as some people may believe.#$b#And I would know, I am two-time award winner, author Rodney O'Brien!$1",
  "fall_Fri2": "Would you believe me if I told you I once had hair as long and as luscious as Elliott's?#$b#I went bald in my thirties, though.$2#$b#Elliott thinks he beat me at genetics, but I noticed a few spots where his hair are getting sparse...",
  "fall_Fri4": "Almost every time I enjoy a walk in East Scarp, I run into Eloise and she always has something new to teach me about birds!$1#$b#I find it equally annoying and cute.$1#$b#She reminds me of the Page of Wands.$3#$b#This tarot arcana suits someone who's cheerful, energetic, fearless and extrovert! Don't you think it fits Eloise perfectly?$3",
  "fall_Fri6": "Pam and I are not really friends, but I came to know her. Especially through my friendship with Gus.#$b#She's a pretty nice lady, once you get to know her.#$b#I picked a tarot arcana for her.$3#$b#The Devil!$3#$b#Not that I believe she's the Devil! But this arcana is generally associated with an addiction or depression. It represents the shadow self of someone: negative habits, relationships or thought patterns.$3#$b#I know it's a bit sad, but it's not set in stone, you know? I wish her the best and I feel like she's been better lately, don't you?$2",
  "fall_Fri8": "Hey @, did your hear about the claustrophobic astronaut?#$b#He just wanted a bit more space!$1#$e#Get it?",
  "fall_Fri10.Platonic": "Now that I've started writing again, I have so many ideas!$1#$b#Those short stories inspired by life in Stardew Valley gave me some new ideas. I would love to write a novel about the Dwarves.#$b#Apparently they referred to themselves as Sky People. Now that would make some quality science fiction!$1",
  "fall_Sat": "I heard Mayor Lewis is in a secret relationship with one of the townspeople!#$b#I won't tell you who it is or how I came across the information, so don't bother asking.$5#e#Okay, I got the intel from Gus, but I won't say more!$5#$e#Will you stop asking?$5",
  "fall_Sat2": "Someone told me that Caroline has a secret room behind her kitchen. I wonder what she does in there...",
  "fall_Sat4": "Hello hello hello @! I got too much takeout from the saloon, you want some?$1[196 224 225]#$b#To tell you the truth, I brought lunch to Elliott and he told me he needed some time alone to 'Think about the meaning of his written words'...$2#$b#He's so brainy sometimes...$2",
  "fall_Sat6": "I spent last evening in front of the TV. Finally got around to watching that documentary on clocks.#$b#It was about time!$1#$e#Get it?",
  "fall_Sat8": "I don't think I will ever be tired of Fall.#$b#I mean, look at those colors!$1#$b#Plus, those colors go perfectly with my beard, don't you agree?$1",
  "fall_Sat10.Platonic": "You know what it is...$4#$b#It's tarot time!$3#$b#$y 'Which tarot arcana matches granny Evelyn personality?_The Queen Of Cups_Wrong! The Queen Of Cups is about someone who shows compassion, warmth and kindness while acting as a counselor. It's better suited to Marnie!$3_The King Of Swords_That is correct! The King Of Swords represents mental clarity, intellectual power, authority and truth. I can't think of a tarot arcana more appropriate for her!$3",
  "fall_Sun": "I am an accomplished writer, but my autobiography didn’t sell at all…$2#$b#It's the story of my life!$1#$e#Get it?",
  "fall_Sun2": "You know the calendar in front of Pierre's shop?#$b#I'm afraid for it...#$b#His days are numbered!$1#$e#Get it?",
  "fall_Sun4": "As a science fiction writer, I was thrilled when I learned that a scientist was living in town!#$b#But when I met Demetrius, I realized he was way more into science than fiction.$2#$b#He reminds me of the Knight of Pentacles.$3#$b#He's all about hard work, productivity, routine and conservatism...$3#$b#That's not how I picture life $1",
  "fall_Sun6": "Great, you're here! I've got a seasonal farming joke for you.#$b#How do you fix a broken pumpkin?#$b#With a pumpkin patch!$1#$e#Get it?",
  "fall_Sun8": "You see @, I am aware that my jokes are corny and silly, but my wife really enjoyed them. And so did Meredith, when she was younger.#$b#Cracking dad jokes reminds me of a happier time.$2#$b#Not that I'm not happy, I mean. I'm just... lonely sometimes.$2",
  "fall_Sun10.Platonic": "It's Sunday, which means many townspeople will visit the altar of Yoba in Pierre and Caroline's house.#$b#$y 'Tell me @, do you believe in Yoba?_Yes! I will visit the altar later today._Really? I never would have thought you'd be the religious type._Nope._Me neither. Then again, it's hard to not turn out atheist when you grow up in a family full of witches and artists like mine.$1",
  "winter_1": "You know what the worst part of Winter is?#$b#The cold forces me to wear pants at all time.$2#$b#At home, I mean, of course. Why would be I running around town pantless?$4",
  "winter_Mon": "I wish my daughter would visit me in the Valley. She's my favorite person!#$b# She's about your age, but she's obviously smarter.$1",
  "winter_Mon2": "My daughter Meredith will soon graduate college. She's studying theatre at the Ferngill National School of the Arts.#$b#I'm proud of her, obviously. But I'm a bit disappointed that she chose theatre over writing.$2",
  "winter_Mon4": "Caroline asked me what kind of tea is hard to swallow.#$b#I told her it's reality!$1#$b#She didn't laugh.$2",
  "winter_Mon6": "Let me share some writing wisdom with you. Whenever I write science-fiction and I need to up my word count, I just go with techno-babble!#$b#You basically have characters say nonsense that seems like science. The most common is saying 'Reverse the polarity!'.#$b#It doesn't mean anything, people will buy it. Every time.$1",
  "winter_Mon8": "I don't miss much about my life in Zuzu City, but to be honest I wish I could attend more meeting of the Ferngill Science Fiction Writers Association.$2#$b#Well, I've isolated myself from the big city so I guess that's on me.$1#$b#Now my writers friends and I mostly exchange via mail. Like old people.#$b# At some point, I got this cool custom stationery which starts with 'You have been deemed worthy of receiving a letter from two-time best novel of the year award author, Rodney O'Brien.'#$b#My friends didn't like it so I changed it.$2",
  "winter_Mon10.Platonic": "I'm very proud of Meredith.#$b#She accomplished so much and she's not even thirty years old!#$b#When I was her age, I was still working odd jobs in Zuzu City by day and writing at night.#$b#I can't wait to see what she does next.$1",
  "winter_Tue": "I had a very interesting chat with Gunther the other day. He knows the history of the Valley so well, it's pretty fascinating, actually.",
  "winter_Tue2": "Are you friends with Gus? I love talking to him. He's one of the nicest person in the Valley.#$b#If he was a tarot arcana, he'll be Justice.$3#$b#It's a no-brainer. Justice stands for truth and fairness. That's my friend Gus!$3",
  "winter_Tue4": "I really wanted my daughter to visit me today, but she really hates the snow.$2#$b#She never really got used to it, growing up in Zuzu City. The city's so polluted that snow never really sticks to the ground.$2",
  "winter_Tue6": "You know @, when I was younger I didn't have a beard.#$b#Truth be told, I used to hate facial hair.#$b#But then, it grew on me!$1#$e#Get it?",
  "winter_Tue8": "When I was in college, I experimented a lot with my facial hair.#$b#Long story short, I look weird with only a mustache.$2",
  "winter_Tue10.Platonic": "I was walking on the beach last week and I tripped on a book!#$b#A library book! Buried in the snow!$5#$b#I'm so glad Gunther replaced the previous librarian, that one didn't know how to care for his book collection!",
  "winter_Wed": "You know, ever since I came to the Valley, I feel like my writer's block is gone.$1#$b# Well, not gone gone, but I've been on a roll writing-wise, and it feels so good to be creative again.",
  "winter_Wed2": "Hey @. What did one wall say to the other?#$b#...#$b#I'll meet you at the corner!$1#$b#Get it?",
  "winter_Wed4": "On Wednesdays, I wear pink.",
  "winter_Wed6": "Mayor Lewis told me he wanted to develop a ski resort in the mountains.#$b#I warned him about starting his own ski resort.#$b#It's a slippery slope!$1#$e#Get it?",
  "winter_Wed8": "When Meredith was born, I was scared.$2#$b#Becoming a dad was a lot and I felt like I wasn't ready.#$b#It took me some time to adjust, but I think I did mostly alright.#$b#I got the dad jokes thing nailed pretty quick, though!$1",
  "winter_Wed10.Platonic": "Have I ever told you that on Wednesdays, I wear pink?$1",
  "winter_Thu": "Don't you like the sound of your footsteps on the snow? That's one of my favorite sounds in the entire world.",
  "winter_Thu2": "Hello there @!#$e#Need something?#$e#I told you. I won't sign any autograph.$5",
  "winter_Thu4": "I asked Gunther if he liked science-fiction.#$b#'I prefer science over fiction' he said.$2#$b#I wish I could find a fellow science fiction enthusiast to binge watch the new season of Stellar Gallivant: Uncovering with me.$2",
  "winter_Thu6": "Do you know why snowmen are great at parties?#$b#They always know how to break the ice!$1#$e#Get it?",
  "winter_Thu8": "I've been trying to figure out which tarot arcana represents Aideen the best and I think I finally found it.#$b#The Ten Of Pentacles!$3#$b#It represents tradition, legacy, roots, ancestry, stability and tradition. It's pretty much how I would introduce Aideen to someone.$3",
  "winter_Thu10.Platonic": "I'm really grateful for my life here. I enjoy walking around East Scarp, the neighbors are friendly. I'm glad you became my friends and it's always a pleasure when Meredith visits!#$b#Oh and Elliott is nice of course.$4",
  "winter_Fri": "I offered George a Tarot reading the other day. Do you know what he said to me?#$b#'Don't bother with your heathen practices, young man!'$5#$b#I love the fact that he called me 'young man'.$4",
  "winter_Fri2": "Hi @! How is everything going on at %farm Farm?#$b# Are you hungry? Here. Take this.[210 211]#$b# I made too much this morning, and I'd hate it to go to waste.$1",
  "winter_Fri4": "I'm not a big fan of Winter, but I won't complain too much.#$b#The world needs every season to function and we all depend on the balance.#$b#Plus, if there was no Winter, would you be happy when spring comes?$1",
  "winter_Fri6": "Hello @! Do you know why did the orange lose the race?#$b#It ran out of juice!$1#$e#Get it?",
  "winter_Fri8": "Hey farmer! Do you know what you get when you cross a snowman with a vampire?#$b#Frostbite!$1#$e#Get it?",
  "winter_Fri10.Platonic": "You know @, when I first met you, I thought you were pretty dumb and rude.$2#$b#I was wrong.$4#$b#You're not rude!$1#$e#Oh come on, it's a joke. Mostly.$1",
  "winter_Sat": "I've been wondering for quite a while what does Mayor Lewis do with all the tax money he collects from businesses around town. I mean, where does it all go? Don't you find it a bit suspicious?$2",
  "winter_Sat2": "I know what you want.$5#$b# You want to have a private creative writing lesson with the world-famous two-time award winner author, Rodney O'Brien, don't you?$1#$b# Well, too bad. I stopped teaching, and I don't want to do that again.$5",
  "winter_Sat4": "Hey @ farmer! Do you know what falls in the Winter but never gets hurt?#$b#Snow!$1#$e#Get it?",
  "winter_Sat6": "Willy told me a great joke the other!#$b#Do you know where boats go when they're sick?#$b#To the dock!$1#$e#Get it?",
  "winter_Sat8": "Hello @! Have you heard about the snowman who fell in love with a mitten?#$b#It was glove at first sight!$1#$e#Get it?",
  "winter_Sat10.Platonic": "I can't wait for tomorrow night!#$b#Why? Well because Stellar Gallivant: Uncovering airs on Sunday nights!$1",
  "winter_Sun": "Hello @! You seem like a quite interesting person. Maybe I'll ask my tarot cards if you're trustworthy.",
  "winter_Sun2": "A cold winter Sunday would be the perfect day for a Stellar Gallivant marathon. Just enjoying some quality science fiction, tucked in a comfy blanket with a good cup of coffee.$1",
  "winter_Sun4": "Tonight, I'm gonna catch up on the new season of Stellar Portal.#$b#After that? Well I still have the new Stellar Skirmishes movie to watch.#$b#Who I am kidding? I'm gonna watch some classic Stellar Gallivant episodes instead.$1",
  "winter_Sun6": "I've spending quite some time at the Saloon lately. I mostly go there for lunch, it's way less crowded this way.#$b#I stopped by the other night on my way back to East Scarp and it's was so packed that I saw someone sitting on top of the jukebox.$1",
  "winter_Sun8": "The other day, my daughter told me that I needed to start embracing my mistakes.$5#$b#So I hugged her!$1#$b#She wasn't pleased.$2",
  "winter_Sun10.Platonic": "I was thinking of having my ashes stored in a glass urn when I die.#$b#Remains to be seen.$1#$e#Get it?",
  //Specific days
  "spring_12": "Will you attend the Egg Festival tomorrow? With these thick farmer legs you have, you should win the Egg Hunt with ease!$1#$b#Just watch out for Abigail, I heard she's terrifyingly good.$2",
  "spring_23": "Don't forget to wear your fanciest clothes for the Flower Dance tomorrow!#$b# If you're lucky, someone might even do you the favor of dancing you!$4#$b#Not me though, I have standards.$1",
  "summer_10": "Tomorrow is the beach festival!$1#$b# Yeah, I know that's not its name, but beach festival sounds much better.#$b#I'm a two-time award winning author, I know better, trust me.$1#$b#%Rodney pats your head.",
  "summer_27": "@! Are you ready to experience the thrill and the mystery that is the Dance of the Moonlight Jellies tomorrow night?$1#$b#Don't bother brushing up on your jellyfishes facts. Just talk to Eloise.#$b#That little brat knows way to much about everything...$5#$b#Could I be jealous of a child?$2#$b#Nah, she's just a brat.$1",
  "fall_7": "Only a few days until the Stardew Valley Fair! I sure hope you're working hard to be ready.#$b#Why? Well, you haven't been living on %farm Farm that long, my dear @ and I know for a fact that everyone in town will judge you based on how your grange display performs at the Fair.#$b#No pressure, of course. I'm sure you'll do great.$1#$b#%Rodney looks away.",
  "fall_15": "Hello there, farmer @. I thought you'd be busier today with the Stardew Valley fair tomorrow.#$b#I hope you are ready for the most important event of the season.$1",
  "fall_26": "Did you get Mayor Lewis mail about tomorrow? You know, the one with 'Notice a chill in the air?'#$b# I wrote it for him.#$b#Of course, he made me edit it. The previous version was not very appropriate for a family friendly event...#$b#What can I say? I like writing about scary monsters and eldritch horrors.$6",
  "winter_7": "I'm looking forward to the Ice Festival tomorrow! Not that I intend to enter the fishing competition, but I really enjoy the forest in the Winter.",
  "winter_24": "Are you confident about the gift for your Secret Friend for tomorrow?#$b# Who's my Secret Friend? Wouldn't you like to know.$5",
  "fall_5": "Did you remember to wish a happy birthday to Elliott?#$b# I got him a t-shirt saying 'My uncle is two-time Award winner at FernCon, Rodney O'Brien, and all I got was this lousy obsession with writing'.$1#$b#I don't think he liked it.$2",
  "summer_3": "IT'S MY BIRTHDAY!$6#$b#Oh that's it. I love to behave like a teenager for my birthday so I'll probably sneak out and drink beers in front of the ocean.$4#$b#Wait, I'm an adult. I can do that.$1",
  "fall_18": "%Rodney seems lost in his thoughts.#$b#Oh hi @.$2#$e#Did you need something?$2#$e#Sorry. I'm not in the mood for a chat today.$2#$e#%Rodney appears to have been crying.",
  "Resort_Entering": "Ah! I can finally spend some time on a beautiful beach, I never get to do that in East Scarp!$1#$b#Well maybe. Like every day. But that's not the same!$7",
  "Resort_Leaving": "I didn't realize it was already time to go home.$2#$b#You think I could spend the night here, alone on this beach?$4#$b#Who am I kidding, Willy would probably find me dead in the morning. I am not good with nature.$7",
  "Resort_Shore": "So you discovered this island, right?#$b#What about the people who already lived there? Did you 'discover' them too?$7",
  "Resort_Umbrella": "I'm not gonna lie to you because we're friends.#$b#I really thought this was a nudist beach.$1#$b#Imagine my surprise when I saw the other changing into their swimsuits. Glad I remembered to pack one, just in case.$4",
  "Resort_Wander": "I love walking on sand. It's such a nice feeling under your bare feet, you know?",
  "Resort_Chair": "Me? Oh, I'm just trying to relax. And you're blocking the sun, @.",
  "Resort_Bar": "If the view at the Stardrop Saloon was as nice as here, you'd see me there every night!$1#$b#I don't usually visit at night though, it's so crowded it's making me a little claustrophobic.",
  "Resort": "Do you want to build a sandcastle, @?#$b#It doesn't have to be a sandcastle.$4",
  // Ginger Island Mainland Adjustments
  "Resort_Approach": "Oh hey @, I can't talk for long. I'm heading to Ginger Island for the day.$1#$b#Wait, did I pack a swimsuit?$4",
  "Resort_Left": "I had a great day on Ginger Island today!$1#$b#Walking on the beach, sipping on an exotic cocktail and enjoying the ocean. That's the life!$1",
  "winterResort_Lef": "Damn it's cold in the Valley.$2#$b#It's crazy how different the weather is between Pelican Town and an island we can reach in a day with Willy's old boat.",
  "Resort_Adventure": "I could sunbathe all day on that beach, but I kinda want to see what's out there. Maybe I could put this island in a book?#$b#Imagine, the story of an intrepid adventurer fighting sentient parrots in his bathing suit while trying to uncover the secrets of the Smoluanu on a deserted island!$1#$b#Instant classic!",
  "Resort_Adventure_2": "It's nice to get away from the Valley for a day and explore something new. I could see myself living here.#$b#Well, maybe not. Those damn parrots look pretty mean and I'm not sure I wanna fight them for their land.$2",
  // Conversation Topics
  "joja_Begin": "So @. You decided to sell out to Joja?$7#$b#I really thought you had principles, but I guess I was wrong.$2",
  "cc_Begin": "I heard you agreed to help Mayor Lewis fix the old community center.#$b#That's great! I hope he's paying you enough.$1#$b#What? He's not paying you anything?$8#$b#You're not very smart, are you?$7",
  "cc_Bus": "I'm glad the bus was fixed. Maybe Mayor Lewis finally decided to use the tax money to fix the town instead of spending it on silly projects.#$b#What? You don't know about the statue?$8#$b#Well. You'll find out soon enough...$2",
  "cc_Bridge": "Did you notice that the bridge leading to the old quarry has been repaired?#$b#Gunther told me that there was a cave entrance beside the quarry...#$b#A cave that leads to a secret tunnel!$1#$b#SECRET TUNNEL! SECRET SECRET SECRET TUNNEL!$6#$b#Sorry, I got carried away...$4",
  "cc_Complete": "Did you really refurbish that old community center all by yourself? Wow, that's an impressive job!$1#$b# Plus, it caused Morris and his Joja goons to leave town, which is a bonus!$1",
  "movieTheater": "Having a movie theater in town is awesome!$1#$b#I hope they screen the new Stellar Skirmishes movie when it comes out!",
  "pamHouseUpgrade": "Did you really pay for Pam's house?$8#$b#That's pretty generous of you. I'm glad for her and Penny!$1#$b#Would you consider paying Robin to build a proper house for Elliott as well?",
  "pamHouseUpgradeAnonymous": "I can't believe someone basically donated Pam a house!#$b#I'm glad for her and Penny, but I wish this person would also do something about Elliott's shack...",
  "MeetingMeredith": "I'm glad you got to meet Meredith while she was in town! Hopefully, she'll be back soon!$1",
  "DwarfStory": "I'm working on the short story I told you about. I went to visit Gunther to get some information, he helped a lot!",
  "ShadowfolkStory1": "I'm working on the short story about the Shadowfolk I told you about. The ",
  "ShadowfolkStory2": " wouldn't talk to me so I went to see Gunther. He lent me a fascinating book on the subject!",
  // "EdwinaAppears": "I still can't believe what Nana told me.$2#$b#I can't imagine what the last forty years must have felt like for her.$2#$b#I'm glad your 'forest magic' made her noticeable to the {{WizardGender}}, though. Without you she would still be stuck there.#$b#What I'm trying to say is, thank you @.$4#$b#We still need to talk about that forest magic stuff. Are you some kind of fairy?",
  "RodStoryReading": "Thank you for listening to my story the other day, @. I'm letting it rest for a few days before editing it. Then, I'll send it to my publisher.",
  "BookLaunchParty": "Hello @, thank you for being there for the party at the Saloon.$1#$b#Gus may have ended up inviting everybody in town, I'm very glad you could make it.$4",
  "FerngillNationalLibraryReading": "I can't believe I got to read my story at the Ferngill National Library! Teenage me would have been so proud.#$b#Oh, I am too, don't get me wrong. I spent so much time there, writing, reading, plotting. That place has always been kinda magical to me, you know?#$b#Anyway, thanks again for coming with me @.$1",
  "RodneyBirthaySuit": "Hey.$5#$e#So, please knock before entering my home, okay?$2#$b#Did you enjoy the view at least?$4#$b#%Rodney has a 6-pack.",
  "RodneyPoetryReading": "You wouldn't believe what happened the other day.$5#$b#I went on my balcony to share the gift of poetry to my neighbours in East Scarp only to get yelled at!$8#$b#A few of them were supportive, but I can't believe the majority doesn't seem to appreciate some good midnight poetry reading.$2",
  "RodneyOliverPlotHole": "Oh hey @. Sorry, I'm a bit confused right now. That Oliver kid pointed out a plot hole in one of my books.$2#$b#But I'm thinking, I could use to my advantage and write the next installment in the Deference Arlington saga! Imagine, a new book coming more than twenty years after the previous one.$1",
  "reject_534": "Dear Yoba, where did you find this?$1#$b#Oh no, it's not mine, but it's pretty. If you found it around East Scarp, you could ask Rosa. I'm pretty sure that girl knows everything that goes on in these parts...",
  "Aideen_Garden": "I visited Aideen's beautiful garden next to the Community Center. It's gorgeous.#$b#I should really hire her to do the same thing next to my house!$1",
  "SterlingTrash": "Gus told me Sterling might be having too much fun these days with his buddy Shane...$2#$b#Oh I'm not judging, I was a dumb kid once too if you can believe it.$1",
  "SterlingRiver": "I'm glad this kid Sterling got his act together. I've struggled with addiction when I was younger and trying to get rid of it is no small feat. If you run into him, give him my best, okay?",
  "elliott_writing_letter1": "My nephew has found a new way of procrastinating!$7#$b#Instead of working on his novel, he now spends hours writing letters to the townspeople.#$b#...#$b#I'm so proud of him! Procrastination is an essential part of a writer's life!$1",
  "elliott_writing_letter2": "Elliott sent me a letter to thank me for my guidance and my input on his writing. He also said that he felt that he didn't deserve to have such a great writer coaching him and asked that I refrain from helping him.#$b#It was a nice try, you know. Flattering my ego. He won't get rid of me that easily, though.#$b#I will still be there, hovering behind him, commenting on every sentence. Forever.$1",
  "elliott_writing_letter3": "Elliott has been having trouble while revising the first draft of his novel.#$b#I sympathize. Revising is not easy. You won't believe how many first drafts are still waiting for revision on my computer.$2",
  "elliott_writing_letter4": "I offered Elliott to send his novel to my publisher. He politely refused, saying he needed to get published on his own merit.#$b#That's very noble of him.#$b#I still sent it to my publisher, though.$1",
  "JulietGremlin": "Have you met the pitiful excuse for a dog that Juliet found?$7#$b#It's so fluffy!$1",
  "JunaBeachBallet": "I witnessed a rather peculiar apparition last night. I was leaving Elliott's house - I often spend rainy days with him to coach him during his writing sessions. Anyway, I exited the shack and in the rain, I saw the shape of a white haired ballerina dancing on the wet sand.#$b#That's was surreal and I still don't know if it was an hallucination or not.",
  "JunaForestPicnic": "So... how was the picnic?#$b#Gus told me that Juna bought food from the saloon for a 'nice little picnic in the forest'.#$b#I hope you had an umbrella!$1",
  "BigFootWizard1": "Something really weird happened to me recently.$2#$b#I was on the beach, minding my own business. And then, out of the blue came that girl Juna, talking to me like we were old pal or something.#$b#She then proceeded to explain to me, in great details, how the ",
  "BigFootWizard2": " is in fact a member of the Big Foot people.#$b#And they say my fantasy stories are bad!$1",
  "LavrilUnlocked": "Eloise has been acting weird lately.#$b#I mean, weirder than usual. This morning, when I said hi she didn't mention a single fact about birds.$2",
  "LucikielArrives": "When I was just a boy, my Nana told me the tale of the Golden-Eyed Demon.$2#$b#A warrior so powerful no one could face him and live...$2#$b#It can't be the same guy, can it?$2",
  "ReputationIncreased": "Have you spent some time with the demon man?#$b#Turns out, he's not a bad dude and he can be kind of fun to be around, once you get his dry sense of humor.$1",
  "JasperGone2": "Do you know how long professor Jasper will be gone?$2#$b#I'm gonna miss having a resident expert on dwarves in the library!",
  "JasperHomeA": "I'm glad Jasper made it back in town.$1#$b#The place didn't feel as lively with him gone.#$b#Well lively might not be the correct word. Smart? Brainy?",
  "keahi_prank": "Oh dear Yoba, you stink!$8#$b#Did you roll around on the floor of Jacob's barn?$2",
  "YriIntroduction": "You met Yri, right?#$b#I went to her when I moved here and thanks to her remarkable design and Robin's impeccable craftsmanship, a nearly collapsed silo became my home!$1",
  "AfterProposal": "Let me stop you right there. I know Yri and Charles are getting married. I was eating lunch at the saloon, having a nice chat with Gus. She burst in, yelled 'I'M GETTING MARRIED' and left.$1",
  "YriShack": "I asked Yri what she could to do to improve Elliott's shack, and she told me that this building is in fact a converted storage shack!#$b#I can't believe Lewis would sell such a piece of crap to my nephew.$5",
  "MateoAcceptance": "Gunther told me that Mateo joined the Adventurer's Guild!#$b#Good for them. I'm sure Marlon's happy to have someone young and efficient in his ranks.#$b#What, you're a member too?$8#$b#As a mascot, right?$7",
  "GuildComplete": "I'm so excited about the Adventurer's Guild opening a branch in East Scarp!$1#$b#Now, every time I have a question about well, adventuring, I can just take a stroll to the beach and ask Mateo!#$b#You know, for research purposes.$4",
 
  "EliIntro": "You met my neighbor Eli? He and his brother Dylan live in the house across from mine.#$b#Dylan is smart and Eli is... how should I put it?#$b#A special little boy?$7",
  "DylanIntro": "I noticed you met Mr Ocean Super Nerd. I hope he didn't bore you to death speaking of plankton or something.#$b#Don't me get me wrong. Dylan is very smart and he seems nice, but he's kind of a weirdo. But not like an Eli level weirdo.", //added in 1.0.8

  "wedding": "I heard you and %spouse finally tied the knot! Congratulations!$1#$b#Now, why wasn't I invited to the wedding?$7#$b#I'm great at weddings!$1",
  "luauBest": "I know I've said that soup in Summer is a stupid idea, but man, this year's soup was the most delicious dish I've ever tasted.$1",
  "luauShorts": "Whoever puts Lewis' shorts in the potluck is a genius!$1#$b#It's a shame to waste food, but as I have stated numerous times, soup in Summer is a stupid idea, so I don't really mind.",
  "luauPoisoned": "I'm glad I didn't have any of the potluck's soup.$2#$b#I mean, I'm all in favor of protesting against the establishment, but I don't think the Governor deserved to be poisoned. I hope he's okay.$2",
  "divorce": "I heard about your divorce...$2#$b#That's rough, buddy. If you need to talk, feel free to drop by my house.$2",
  "babyBoy": "Congratulations on becoming a parent!$1#$b#How's little baby %name doing?#$b#Wait, that's not his name?$2",
  "babyGirl": "Congratulations on becoming a parent!$1#$b#How's little baby %name doing?#$b#Wait, that's not her name?$2",
  "joja_Complete": "So... you went all the way, huh?$7#$b#Selling out to Joja until there was nothing left...$2",
  "willyBoatRepaired": "I boarded Willy's boat, hoping for a fun sea faring adventure, but when I stood on the deck and started singing sea shanties, he told me, in a not very friendly way, to shut my mouth.$2#$b#What a killjoy.$7",
  "leoValleyArrival": "So... you found a wild kid on a deserted island and you decided to bring him here?$7#$b#If he murders us all in our sleep, that will be on you.",
  "islandResortUnlocked": "I heard a resort opened on Ginger Island!$1#$b#I might visit someday... Do you know their clothing policy?$4",
  "railroadEarthquake": "The earthquake last night knocked me off my bed! I thought my house was going to collapse.$2",
  "MaruCometSighting": "Have you gazed at the comet the other night? I watched from the Deep Mountains, it was breathtaking!$1",
  "HaleysCakeWalk": "Guess what, Haley, who never said much to me before, came to me asking me to donate a cake from her little event!#$b#Since it was for charity, I pitched in of course!$1#$b#Well, truth be told, I bought a cake from Gus because I can't cook, but still.$2",
  "ElliottTourOver": "My nephew told me his book tour went great!$1#$b#I'm so proud of him. Soon, he'll be touring the whole Ferngill Republic for months, sleeping in crappy motels and eating at gas stations because his publisher won't pay for more.#$b#Living the dream!$1",
  "MineralTownIntro": "So I heard you visited Mineral Town. What did you think of it?$1#$b#What? Oh, how do I know? My friend Zack told me he gave you the grand tour! We go way back, Zack and I. He's an old gym buddy of mine!",
  "CamieIntro": "Hey, you met Cambria? She's a nice girl and she makes mead to die for.$1#$b#She has the weirdest chicken, though.$2#$b#I don't know why but it kind of reminds me of my Nana.",
  "MayoPlan": "Gus told me some of the townspeople have started drinking mayonnaise.#$b#Like in a mug or a glass.$2#$b#I'm glad this trend hasn't reached East Scarp for now.", //added in 1.0.8
  "RodneyMeetsFievel": "Don't panic, @, but I think there is a giant rodent living in East Scarp.$8#$b#I'm torn between calling an exterminator or embracing our new mouse overlord. I'm leaning towards embracing it, because I don't wanna hurt such a cute mouse.", //Added in 1.0.8
  "Fievel2H": "I never noticed the cave on the cliff behind my house before. I heard some noise coming from it the other day and I saw Aideen's enormous cat coming out of it. I wonder what's going on.", //Added in 1.0.8
  "Fievel10H": "I finally explored the cave on the cliff behind my house and turns out it's a lovely troglodytic house!$1#$b#And there's a cute, yet giant, mouse living there. He tried to sell me a pufferfish for 3 pieces of cheese so there's that.", //Added in 1.0.8
  "LitD_CT_ShadowPlay": "I think Elliott's shack has a gas leak or something.#$b#The other night, I was going home after spending the day there, being my usual quality writing coach, and I noticed two people running around near Emily's house.#$b#And they looked exactly like the Shadowfolk from the legends!$8#$b#There is no such thing of course, so my money's on gas leak. Or maybe asbestos.", 
  "LitD_CT_GardenCompleted": "Have you ever visited the cave on the East Scarp beach? That place looks scary.$2#$b#I swear I heard some voices coming from there the other day.$2#$b#Oh well, it's was probably the kids!$1#$b#Right?$2", 
  "LitD_CT_SensFlowers": "Have you noticed those beautiful flowers that started growing everywhere? They look like crocuses, but prettier!$1",
  "Rodney.CT.EveMeet": "", //added in 3.1.0
  "Rodney.CT.JeremyIntroduction": "", //added in 3.1.0
  "Rodney.CT.NoraClass": "", //added in 3.1.0
  "Rodney.CT.NoraSad": "", //added in 3.1.0
  "Rodney.CT.NoraBusy": "", //added in 3.1.0
  "Rodney.CT.NoraProud": "", //added in 3.1.0
  "Rodney.CT.NoraJob": "", //added in 3.1.0
  "Rodney.CT.NoraChameleon": "", //added in 3.1.0
  "Rodney.CT.guntherEscortDenied": "", //added in 3.1.0
  "Rodney.CT.museumCompleted": "", //added in 3.1.0
  "Rodney.CT.jojaEmporium": "", //added in 3.1.0
  "Rodney.CT.election": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.": "", //added in 3.1.0
  "Rodney.CT.married_Elliott": "", //added in 3.1.0
  "Rodney.CT.divorced_Elliott": "", //added in 3.1.0
  "Rodney.CT.wonIceFishing": "", //added in 3.1.0
  "Rodney.CT.GreenRain.1": "", //added in 3.1.0
  "Rodney.CT.GreenRainFinished": "That weather was wild, yesterday! And I really enjoyed doing some solo LARPing!$1#$b#Although, Demetrius did not seem amused by my performance...$2", //added in 3.1.0
  "Rodney.CT.GreenRain.2": "", //added in 3.1.0
  "Rodney.CT.wonIceFishing": "", //added in 3.1.0


  //Festival dialogue Platonic (string name has been edited in 2.0.0 )
  "Rodney.EggFestival.Platonic": "Do you like my hat?$1#$b#I was at the library last week and Vincent, Jas and Eloise were planning on painting eggs for the Egg Festival. Eloise said my head looked like an egg.#$b#Long story short, Vincent made this hat for me. I am pulling it off though.",
  "Rodney.FlowerDance.Platonic": "What a silly yet quaint event. Do you want to dance with me?#$b#You know that I'm kidding right?$2",
  "Rodney.Luau.Platonic": "It's great to hang on the beach with everyone, but I still believe that having hot soup in the scorching heat of Summer is the dumbest idea ever.#$b#Especially with pants on.$2",
  "Rodney.Jellies.Platonic": "Jellyfish are fascinating creatures. I've always been equally amazed and terrified by them.",
  "Rodney.Fair.Platonic": "The Fair is quite impressive! I didn't expect that from a small town!$1#$b#Now... how do you think I should approach Welwick to ask a few questions about tarot readings?$3#$b#I've always admired their work so this is kind of a 'Notice me, senpai' situation for me.$2",
  "Rodney.RSVgathering.Platonic": "Every time I attend the Gathering, I genuinely wonder what is going on.$7#$b#It is some kind of gender-based warfare? Is it just good fun? Did Lenny have a vision in a dream telling her to organize this event?#$b#I guess I'll never know for sure.$1", //Ridgeside Gathering
  "Rodney.SpiritsEve.Platonic": "Commander @, we are under attack! Rotate the shield's harmonics! Launch photon torpedoes, full spread!$1#$b#We took a direct hit, evasive maneuvers! Fire phasers!$8#$e#Who am I dressed as? Well, my dear @, I'm Captain Pierre-Jean Breton, the lead character of Stellar Gallivant: The Second Genesis.",
  "Rodney.IceFestival.Platonic": "Do you wanna build a snowman?#$e#It doesn't have to be a snowman.$4",
  "Rodney.WinterStar.Platonic": "Merry Winter Star my dear @! I hope you haven't been naughty, otherwise your only present will be some coal and clay!$1#$b#Or worse...#$b#Like, I don't know, having to talk to Clint for more than five minutes, something like that.$7",
  "Rodney.RSVember.Platonic": "What are you wishing for, farmer?$1#$b#Me? Oh, nothing. I have everything I need in this world.#$b#Well... I might wish for another Stellar Skirmishes movie trilogy!$1", //Ember of Resolutions (Ridgeside)
  "Rodney.Fireworks.Platonic": "I'm very happy we can enjoy some beautiful fireworks in the Summer.$1#$b#I just wish this was funded by the local taxes, you know? I'm still wondering what Lewis is doing with that money.$7",
  "Rodney.Surfing.Platonic": "Hey there farmer! Or should I say surfer?$1#$b#I will be cheering for you during the race.#$b#Don't let me down!$7", 
  "Rodney.Marketpalooza.Platonic": "My dear farmer, I'm very happy to see you here! Would you like to browse my wares?$1#$b#And remember, it's for charity so don't be cheap.$7", 
  "Rodney.FashionFestival.Platonic": "Fancy seeing you there, @! I didn't know you were interested in fashion.$1#$b#Me? Oh, I just pulled this old thing from storage for today.", 
  "Rodney.LoveFestival.Platonic": "You're still young, farmer. Enjoy love and life while you can!$1#$b#Oh don't worry about me. I'm not sad. Just a tiny bit melancholic. All this talk of love reminds me of Annwenn, the love of my life.", 

    //Festival dialogue romantic added in 2.0.0
  "Rodney.EggFestival.Romantic": "Hey there sweetie. Would you like a hat matching mine?$1#$b#Vincent was happy to make this one for me. I'm sure I could ask him to make one for you.#$b#I know it looks a little silly, but I'm convincend I am pulling it off.", 
  "Rodney.FlowerDance.Romantic": "I like this silly yet quaint event much better now that we're dating!$1#$b#I mean, I still don't really like having to wear a suit, but it's worth it if I get the chance to dance with you.$4", 
  "Rodney.Luau.Romantic": "It's great to hang on the beach with everyone, but I still believe that having hot soup in the scorching heat of Summer is the dumbest idea ever.#$b#Especially with pants on.$2#$b#How about we skip the festival and go back to my place so I can get out of my bathing suit and change into my birthday suit$4?", 
  "Rodney.Jellies.Romantic": "Hey sweetie! Be careful not to fall in the water!$8#$b#Jellyfish are beautiful creatures, but they can also be deadly.#$b#Stay close to me and I won't let anything bad happen to you.$4", 
  "Rodney.Fair.Romantic": "Are you enjoying the fair, sweetie?#$b#Me? Oh, I've been trying to find the courage to approach Welwick for hours.#$b#I've always admired their work so this is kind of a 'Notice me, senpai' situation for me.$2", 
  "Rodney.RSVgathering.Romantic": "Hey there sweetie! Do you understand what is happening here? I sure as hell don't.$1#$b#It is some kind of gender-based warfare? Is it just good fun? Did Lenny have a vision in a dream telling her to organize this event?#$b#I guess I'll never know for sure.$1", 
  "Rodney.SpiritsEve.Romantic": "Hello Number One! How are you doing on this fine evening?#$b#Number One? Oh, it's how Captain Pierre-Jean Breton, the lead character of Stellar Gallivant: The Second Genesis, calls his executive officer.#$b#And that's how I feel about you. You're number one in my heart.$4", 
  "Rodney.IceFestival.Romantic": "Are you okay, sweetie? You look cold.#$b#Here, come into my arms and I'll keep you warm.$4", 
  "Rodney.WinterStar.Romantic": "Merry Winter Star, sweetie! I hope you haven't been naughty, otherwise you'll only get some coal and clay!$1#$b#Though, I wouldn't mind getting naughty with you later tonight.$4", 
  "Rodney.RSVember.Romantic": "What are you wishing for, sweetie?$1#$b#Me? Oh, nothing. I have everything I need in this world.#$b#A home, a family I love, a job I like, good friends and... you of course.$4", 
  "Rodney.Fireworks.Romantic": "I'm very happy we can enjoy some beautiful fireworks in the Summer.$1#$b#Why don't you lay down with me so we can hold hands and enjoy the show, sweetie?$4", 
  "Rodney.Surfing.Romantic": "Hey there my sweet farmer! Or should I say my sweet surfer?$1#$b#I will be cheering for you during the race.$1", 
  "Rodney.Marketpalooza.Romantic": "My sweet farmer, I'm very happy to see you here! Would you like to browse my wares?$1#$b#You've already seen all of this, but it's for charity so you could get something to gift away. Like an autographed photo for Mayor Lewis, maybe?", 
  "Rodney.FashionFestival.Romantic": "Fancy seeing you there, sweetie! I'm sure the show's gonna be amazing$1#$b#Do you want to get something from the stalls? Although, I'm not sure you could look any better.$4", 
  "Rodney.LoveFestival.Romantic": "Hello my love! I'm happy you could make it here. All this talk of love would have been so depressing if you hadn't come!$4", 

  //Strings from maps
  "RodneyCoffee": "It's Rodney's trusted coffee maker. There's a sticky note on it that says 'Writer's fuel'",
  "StellarGallivant": "The drawer beneath the TV is loaded with DVDs, including the Collector's Edition Box set of Stellar Gallivant: The Second Genesis.",
  "RodComputer": "You catch a glimpse at the title of an opened text document 'The Chronicles of Stardew Valley'.",
  "RodDesk": "On the desk, a sticky note says 'YOU SHOULD BE WRITING'.",
  "Coffee1": "It's a half drank cup of coffee.",
  "Coffee2": "Some old coffee mugs, mostly empty.",
  "RodClothes1": "While you sneak into Rodney's closet, you notice that he owns each piece of clothing twice with a pink version for everything.",
  "RodClothes2": "An important part of the closet is dedicated to storing official replica uniforms of various Stellar Gallivant shows.",
  "RodBoat": "A model of an old sailboat. There's a little plaque that says 'I'll always ship you and me. -Annwenn'.",
  "RodBook1": "The Tarot Revealed: A complete guide to the Ferngill-O'Brien-Smith Tarot by Edwina O'Brien.",
  "RodBook2": "The Complete Deference Arlington Saga (Volumes 1 to 14), by Rodney O'Brien",
  "RodBook3": "My teenage daughter hates me, what should I do? A guide for the single father.",
  "RodBook4": "Stellar Gallivant: the official encyclopedia.",
  "RodRadio": "When you turn the radio on, a loud song by Iridium Crone plays. It's their hit 'The Number of The Void'.",
  "RodSport": "It's Rodney's barbells. You can barely move them.",
  "RodSport2": "This is quality equipment. This is probably how two-time award winner, author Rodney O'Brien, stays in shape.",
  "RodCupboard1": "Stashed between the books, you glimpse a shining trophy with a plaque that says 'Worst Fantasy Novel of The Decade Award'.",
  "RodCupboard2": "There are mostly coffee mugs in this cupboard.",
  "RodFridge": "This fridge is full of delicious meals... packed in takeout containers from the Saloon. And some vinegar.",
  "RodDeskTrash": "You found a crumbled sticky note with the words 'Steampunk Joja ?' on it.",
  "RodGarbageCan": "This garbage can is full of garbage.",
  "RodFloorBook": "Mysteries of the Dwarves, by M. Jasper.",
  "RodFlowers": "Some pretty flowers. They probably come for Aideen's.",
  "RodTarot": "It's Rodney tarot deck. He must have done a tarot spread recently.",
  "RodMailBox": "Home of Two-Time Award Winner, Rodney O'Brien.",
  "RodLaptop": "Rodney's laptop is protected by a password. What did you expect?",
  "RodBoard": "This board is covered in notes. It seems to be the plot of a novel.",
  "RodTub": "Nice bathtub. As you stare at it, you start to picture Rodney taking a long warm bath in his birthday suit.",
  "RodWindow": "You can see most of East Scarp from up here. What a view!",
  "RodLaundry": "This is Rodney's laundry. Do you really want to rummage through it, you weirdo?",
  "RodAwards": "This award display case is covered in dust. The top award is the Best Novel Of The Year Award from the FernCon. This other one is the Lifetime Achievement Award from the Science Fiction and Fantasy Writers of Ferngill Association.",
  "RodTree": "This tree is as dead as your manners.",
  "RodBox1": "This box is labeled 'Fan mail'.",
  //Gift Tastes
  "RodLove": "This is an amazing gift! You know me so well, @!",
  "RodLike": "Ooooh, that's nice! Thanks @.",
  "RodDislike": "I know people say it's the thought that counts, but think harder next time, okay?",
  "RodHate": "You know what this is? This is the worst thing anyone has ever given me. And I was once bestowed the Worst Fantasy Novel of The Decade Award.",
  "RodNeutral": "That was very thoughtful of you.",
  //Gift reactions
  "RodneyReaction.StardropTea.1": "Oh wow, that's amazing! I'm usually a coffee aficionado myself, but that's some quality tea! Thank you so much @.$1", //added in 3.1.0
  "RodneyReaction.StardropTea.2": "Now, that's what I call some quali-tea!$1", //added in 3.1.0
  "GiftReaction_Quartz": "Oh! I love this stone! Quartz has so much energy. Thank you so much @!$1",
  "GiftReaction_Quartz~1": "Thanks a lot, @! I really love quartz. This one is going straight into my rock collection!$1",
  "GiftReaction_Banana": "Hmm banana.$1",
  "GiftReaction_Banana~1": "A tasty fruit full of potassium, just what I need! Thank you @!$1",
  "GiftReaction_Banana~2": "Is that a banana or are you just-$8#$b#Oh, it's a banana.$4",
  "GiftReaction_Triple_Shot_Espresso": "Oh my Yoba!$8#$b#Thanks for the writer's fuel.$1",
  "GiftReaction_Triple_Shot_Espresso~1": "I love this so much I could kiss you!$4#$b#Well, I could. But I won't!$1",
  "GiftReaction_Triple_Shot_Espresso~2": "According to the doctor, this is very bad for my heart...$2#$b#But it's good for my writing skills! Thanks a lot @!$1",
  "GiftReaction_Triple_Shot_Espresso~3": "I heard that if you stop drinking coffee, you can lose up to 80% of what little joy you still have left in your life.#$b#Well, I'll never quit coffee. Thanks a lot, @!$1",
  "GiftReaction_Pale_Ale": "There's nothing like the refreshing bitterness of a cold pale ale! Thanks @!$1",
  "GiftReaction_Pale_Ale~1": "Wow, thanks a lot! Did you brew this yourself?$1#$b#I took a class on a how to brew your own ale at home a few years ago. It didn't go very well, though.#$b#Meredith still makes fun of me since...$2#$b#Anyway, thanks again!",
  "GiftReaction_Duck_Feather": "Ooh, so pretty!$1#$b#I love duck feathers, they're so soft!$1",
  "GiftReactionCategory_-2": "I always enjoy a shiny stone, thanks!$1",
  "GiftReactionCategory_-2~1": "How lovely! It's just what I needed to add some sparkle to my day. Thanks a lot!$1",
  "GiftReactionCategory_-2~2": "Oh my! This gem has such a beautiful color. I'll be sure to show it off to Gunther!$1",
  "GiftReactionCategory_-2~3": "It sparkles so brightly! You really know how to make me feel special. Thank you my friend.$1",
  "GiftReactionCategory_-2~4": "This is such an exquisite stone. I'm so grateful for your kindness. Thank you so much, @.",
  "GiftReactionCategory_-80": "That flower is so pretty, thank you so much!$1",
  "GiftReactionCategory_-80~1": "I love flowers, they always make me so happy. Thank you @!$1",
  "GiftReactionCategory_-80~2": "Thank you for the flower! Did you grow it on your farm?#$b#Just for me?$4",
  "GiftReactionCategory_-80~3": "Oh, thank you so much. Flowers really are happy things, don't you think?$1",
  "GiftReaction_Joja_Cola": "I hate that I like this.$2#$b#Thanks for enabling my addiction, @.$1",
  "GiftReaction_Joja_Cola~1": "Caffeine, sugar AND chemicals in a can.$7#$b#That's terrible, but I still enjoy it. Thank you, @.$4",
  "GiftReaction_Coffee": "That smells like a damn fine cup of coffee! Thank you @!$1",
  "GiftReaction_Coffee~1": "Not as potent as a triple shot espresso, but that's still pretty good. Thank you!",
  "GiftReaction_Cheese": "Is that homemade cheese from %farm farm? Thanks!$1",
  "GiftReaction_Cheese~1": "I love it! It ain't gonna slide down easy if it ain't cheesy, as my Nana used to say!$1",
  "GiftReaction_Goat_Cheese": "That piece of goat cheese smells marvelous! Thank you @!$1",
  "GiftReaction_Beer": "Thanks for this beer, I'll drink it when I get home.$1",
  "GiftReaction_Beer~1": "Thanks!$1#$b#...$8#$b#Do you really run around town with glasses of beer in your pockets?$7",
  "GiftReaction_Mayonnaise": "Oh thanks! Praise Mayoba!$1#$b#I like to call it that, because of its divine taste!$1", //Added in 1.0.8
  "GiftReaction_Mayonnaise~1": "Thank you. I promise I won't be drinking it.#$b#And don't think about drinking mayonnaise yourself!$5", //Added in 1.0.8
  //Dislike
  "GiftReactionCategory_-4": "Come on! What should I do with that?$5#$b#Do I look like I know how to cook fish?$5",
  "GiftReactionCategory_-4~1": "Oh my Yoba, is that a dead fish?$8#$b#What should I do with that?$2",
  "GiftReactionCategory_-4~2": "Are you really running around town handing dead fish to people?$7#$b# What's wrong with you?$2",
  "GiftReactionCategory_-4~3": "Listen @. I appreciate a plate of fresh sashimi as much as the next person, but that doesn't mean I want to take that fish, put it in my pocket and eat it later.$7",
  "GiftReactionCategory_-4~4": "I get that you're proud of being a skilled angler, but I only like fish when it's in my plate. Not raw and whole in my pocket.$7",
  "GiftReaction_Bread": "Please, tell me you did not find the bread in the trash before giving it to me.$2",
  "GiftReaction_Bread~1": "Oh great. Trash bread.$7",
  "GiftReaction_Stone": "Oh wow. A stone. Thank you so much for handing me something you picked right off the ground.$7",
  "GiftReaction_Cave_Carrot": "What in the Void is that? Why does it have hair?$8#$b#Thanks, I guess?$2",
  "GiftReaction_Cave_Carrot~1": "Why is it wet?$8",
  "GiftReaction_Cave_Carrot~2": "Oh, a weirdly shaped vegetable you dug out deep underground. Thank you. You shouldn't have.$7",
  "GiftReactionCategory_-21": "What do you think I am, a fish?$5",
  "GiftReactionCategory_-20": "According to my tarot deck, this gift is trash.$3",
  "GiftReaction_Rabbit's_Foot": "Is that...$8#$b#The foot of a rabbit? Why would you give this to me, you maniac?$5#$b#I don't want it. Take it back.$2[446]'",
  "GiftReaction_An_autographed_photo": "Are you really giving it back to me?$5#$b#Do you value my job so little, you monster?$5#$b#Leave me alone.$2",
  "GiftReaction_An_autographed_photo~1": "Listen, if you hate so much that you'll give it back to me, at least do something useful with it. You could always recycle it or offer it to someone else!$5", //changed in 3.0.0
  "GiftReaction_StardropFlower": "@...$8#$b#This probably the prettiest flower I have ever seen, thank you so much!$1",
  "GiftReaction_RabbitFloof": "DEAR YOBA IT'S SO FLUFFY I'M GONNA DIE.$8",
  "GiftReaction_GiftReaction_RabbitClover": "My my, thanks a lot @. I could always use some good luck!$1",
  //Books reaction 
  "RodneyReaction.Book.ArcanaCatcherPrunus": "I...$8#$b#I'm not very proud of this book, but I appreciate the sentiment.$2", //added in 3.0.0
  "RodneyReaction.Book.ArtifactOrCutlery": "Oh thank you! I heard Gunther wrote that book after people kept trying to donate their old silverware to the museum.$1", //added in 3.0.0
  "RodneyReaction.Book.CrabsAndWhyIHateThem": "Thanks a lot, @! This book is a real masterpiece. Mateo's prose when it comes to expressing their hatred of crabs is worthy of an award. Or two!$1", //added in 3.0.0
  "RodneyReaction.Book.DeferenceArlington": "Thanks, but you know I already have that, right? I mean, I wrote it.$7",
  "RodneyReaction.Book.FishingForDumbDumbs": "Thank you, I guess? I don't plan on doing any fishing, though.$7",
  "RodneyReaction.Book.GettingChicksToLoveYou": "Oh, that's nice! Shane is not the most skilled writer, but he makes up for it with his passion when talking about chickens!$1", //added in 3.0.0
  "RodneyReaction.Book.Goblins": "Thanks a lot! I love reading about Professor Jasper's research. Goblins are fascinating, aren't they?$1", //added in 3.0.0
  "RodneyReaction.Book.GuideToSculptingWithGold": "Not this again.$5#$b#I can't believe Lewis wrote a book about the way he spends the town's money for stupid vanity projects.$5", //added in 3.0.0
  "RodneyReaction.Book.HerpetologyOfFerngill": "Thank you! I like having books about various topics when doing research for a novel.$1#$b#Hmm, maybe this one could inspire a giant lizard monster for my next book?", //added in 3.0.0
  "RodneyReaction.Book.LunarkinTrollTales": "Oh! How did you know?$8#$b#I love that book! I used to read it to Meredith when she was a kid!$1", //added in 3.0.0
  "RodneyReaction.Book.MysteriesOfTheDwarves": "Another masterpiece by Professor Jasper! Thank you very much, @!$1", //added in 3.0.0
  "RodneyReaction.Book.PepperRexes": "Thank you! It's not as good as Mateo's other publications in my opinion, but it's an interesting read.", //added in 3.0.0
  "RodneyReaction.Book.TheBookOfYoba": "Hmm, thank you, I guess?$7#$b#Sorry, but I'm not religious at all and this kind of books make me uncomfortable.$2", //added in 3.0.0
  "RodneyReaction.Book.TheGreatBookOfSlimes": "What?$8#$b#Do you know what I hate? Slimes. They're rough and sticky and they get everywhere.$7", //added in 3.0.0
  "RodneyReaction.Book.TheGreatTomeOfMayo": "Yum, mayonnaise! Thank you, @!$1", //added in 3.0.0
  "RodneyReaction.Book.TheJojaConspiracy": "Thank you! I think the person who wrote that book deserves the highest honour in the Ferngill Republic.$1", //added in 3.0.0
  "RodneyReaction.Book.TheTarotRevealed": "According to my tarot deck, this is an excellent gift!$3#$b#Thank you, @. It means a lot that you'd bring me that book.$4", //added in 3.0.0
  "RodneyReaction.Book.WhyPepperRexesAreTheBest": "Thank you! I really like this book, even though I believe Mateo lacks some objectivity when it comes to Pepper Rexes.$1", //added in 3.0.0


  //Pride Festival Items 
    "RodneyReaction.BiBerryMuffin": "Wow, I love this, thank you! Although, making a good bisexual joke is pretty hard.#$b#It can go either way.$1#$e#Get it?", //added in 3.1.0 
    "RodneyReaction.PridePop": "Thank you, dear @! This reminds me that I need to ask you a question. Can you tell me what LGBTQ means?#$b#I can never get a straight answer!$1#$e#Get it?", //added in 3.1.0 
    "RodneyReaction.LesbianLollipop": "My my, thank you! This reminds me of a story. Did you hear about the two female spies who fell in love? It was Lesbianage!#$b#Get it?", //added in 3.1.0 
    "RodneyReaction.GaylacticCookie": "Thanks, @! This cookie reminded me that you can never argue with a gay person...#$b#Because they're not thinking straight!$1#$e#Get it?", //added in 3.1.0 
    "RodneyReaction.EnbyEclair": "This looks delicious, thank you!#$b#By the way, do you know why LGBTQ people dislike coding?#$b#Because it's binary!$1#$e#Get it?", //added in 3.1.0 
    "RodneyReaction.TastyAceCookie": "That cookie does look tasty! Thank you, @!$1#$b#By the way, do you know how you call an asexual lawyer?#$b#An ace attorney!$1#$e#Get it?", //added in 3.1.0 
    "RodneyReaction.ARomanticCookie": "Oh! This one has extra flavour!#$b#Oh wait, it's aromantic, not aromatic!$1", //added in 3.1.0 
    "RodneyReaction.TransTart": "Thank you very much, @. By the way, I was talking to mayor Lewis the other day. He told me that his truck supports trans rights!$1#$b#Because it has trans mission!$1#$e#Get it?", //added in 3.1.0 

  //#BearFam items 
  "RodneyReaction.FerskenPeach_PotentMead": "Uuuuh what?$8#$b#Well, I guess I could use that to clear the bathtub drain...$2", //added in 3.1.0
  "RodneyReaction.BrazierSecretAlfredo": "Did you make this yourself? How did you get that recipe?$8#$b#I love it, thank you so much, @!$1", //added in 3.1.0
  "RodneyReaction.HoneyWheatBread": "Oh thanks, that looks delicious! Wait, Teren made this? Damn, he's not only a pretty face, then!$1", //added in 3.1.0
  "RodneyReaction.SesameBrownBread": "Thank you, @! This is gonna be a treat for dinner. A slice of tasty bread with a little bit of cheese.$1#$b#Okay, maybe a lot of cheese.", //added in 3.1.0
  "RodneyReaction.GudrunPerfectRamen": "Oh, is that a Gudrun recipe? Don't mind if I do! That little brat sure can cook!$1", //added in 3.1.0
  "RodneyReaction.GunnarPerfectRamen": "Wait. A Gunnar recipe? Will it explode???$8#$b#It does look good actually. Thank you!", //added in 3.1.0
  "RodneyReaction.SondraPerfectRamen": "Those ramen are just like Sondra. Sweet, fulfilling and a little spicy.$4", //added in 3.1.0
  "RodneyReaction.SigurdPerfectRamen": "Thank you, @! Sig's recipe is a little too spicy for my taste, but I'll enjoy this anyway!$1", //added in 3.1.0
  "RodneyReaction.FerskenPeach_Mead": "Sweet, sweet mead, come to daddy.$1", //added in 3.1.0
  "RodneyReaction.FerskenPeach_Mead_Tankard": "Cheers, @! Thanks for the nice gift, I was feeling a little thirsty.$1", //added in 3.1.0
  "RodneyReaction.PumpkinJoja": "You know, this doesn't have the right to be as good as this actually is.$1", //added in 3.1.0
  "RodneyReaction.PeachJoja": "Thank you, @. This drink is one of Joja's greatest creation.$1", //added in 3.1.0
  "RodneyReaction.BananaBread": "Oh wow, thank you so much @! This is the best thing ever. It's both bread AND banana. And yet, so much more!$1", //added in 3.1.0
  "RodneyReaction.GunnarThirdPotion": "Oh. Uh. Thanks?$2", //added in 3.1.0
  "RodneyReaction.GunnarPerfectPotion": "I will never sully my body by drinking something Gunnar brewed.$7", //added in 3.1.0
  "RodneyReaction.GunnarRemedyAll": "Dear Yoba, this smells like death.$8", //added in 3.1.0
  "RodneyReaction.GunnarBadPotion": "Are you trying to poison me, @?$7", //added in 3.1.0
  "RodneyReaction.GunnarFirstPotion": "I think you've been scammed, @. If Gunnar knows how to brew actual potions, then I'm the Governor!$1#$b#Wait. Maybe I should run for Governor!$1", //added in 3.1.0
  "RodneyReaction.GunnarMysteryPotion": "I have a feeling that the glass bottle is the tastiest part of this potion.$7", //added in 3.1.0
  "RodneyReaction.GunnarSecondPotion": "I'd rather eat an expired mega bomb than drink this.$7", //added in 3.1.0
  "RodneyReaction.GunnarWeirdPotion": "You know, if you want to get rid of me, just push me of a cliff, it would save you some money.$7", //added in 3.1.0
  "RodneyReaction.Colacrab": "Oh thanks for the Joja Co-$1#$b#WAIT IS THAT A CRAB?$8", //added in 3.1.0

  //A new dream items
  "RodneyReaction.TastyPastry": "Hmmm, this sure does look tasty! Thank you, @. I like it!$1", //added in 3.1.0
  "RodneyReaction.GemBirdPatties": "Thank y- #$b#Wait, is that made from Gem Bird? Gross!$8", //added in 3.1.0
  "RodneyReaction.VoidJuice": "Uh. No thank you. This smells like despair. Or Clint's love life.$7", //added in 3.1.0
  "RodneyReaction.GemBirdMeat": "Why would you give me Gem bird meat? That's so cruel.$2", //added in 3.1.0
  "RodneyReaction.SeaglassFlowerDisplay": "Oh, that's very pretty! Thank you for the kind gift, @!$1", //added in 3.1.0
  "RodneyReaction.Seaglass": "Thank you! This so so beautiful. I loved to collect sea glass!$1", //added in 3.1.0
  "RodneyReaction.FrostedCake": "Hmmmm, cake.$1#$b#Thank you, @. I'm gonna eat this for dessert tonight!", //added in 3.1.0
  "RodneyReaction.HotCereal": "Oh, thank you! This is indeed some hot cereal. Do you know what else is hot?$4#$b#What? The sun. What did you think I was gonna say?", //added in 3.1.0
  "RodneyReaction.WhiteTruffle": "Thank you, @. I know this is very tasty, but somehow, my first instinct when I see a white mushroom is that it's probably poisonous.$1", //added in 3.1.0
  "RodneyReaction.CheesyWhiteRisotto": "Oh wow, thank you so much, @! This meal looks absolutely delicious.$1", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  //Diamond in the rough items 
  "RodneyReaction.UnluckyPurpleShorts.1": "Dear Yoba, the smell!$8", //added in 3.1.0
  "RodneyReaction.UnluckyPurpleShorts.2": "Kill it! Kill it with fire!$8", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0
  "RodneyReaction.": "", //added in 3.1.0

  // Schedule dialogue Platonic 
  //the name of the strings has been changed in 2.0.0
  "rod.001.0": "I like this area. I often come here. It's a great place to think and there's nobody to bother me.$1#$b#Well... except you.$7",
  "rod.001.1": "I like this area. I often come here. It's a great place to think and there's nobody to bother me.$1#$b#Oh I didn't mean it like that.$8#$b# You're not bothering me, @!$4",
  "rod.001.2": "Feel the ocean breeze, @, and let the energy of the Gem Sea flow through you.#$b#Feels good, doesn't it?$1",
  "RodneyFreeAutographDialogue": "Hey, I know how to make your day better. Here take this!",
  "rod.003": "I'm impressed, I didn't know Mateo was a fan.$8#$b#They have some of my books here!",
  "rod.007.0": "You know @, I'm impressed.#$b#I walked all the way out here in order to be alone with my thoughts, and yet you still manage to find me and bother me with your nonsensical small talk.$2",
  "rod.007.1": "You came all the way up here? I'm impressed!$1#$b#Take a moment to breath the fresh air and enjoy the view, it's worth it.",
  "rod.007.2": "Oh hey @! That's a nice surprise. I didn't expect to see you here. I often come here to enjoy the sights.#$b#It's a great place to get the inspiration going.",
  "rod.008.Platonic": "Hello @, I didn't expect to see you at this hour.$7#$b#In my house. While I'm having breakfast.$5#$b#%Rodney takes a sip of coffee, and he mumbles behind his cup.#$b#You're lucky I'm wearing pants.$7",
  "rod.009": "Oh, I'm just listening to my favorite band, Iridium Crone.#$b# You know 'Dread of The Void'? It's my favorite song ever.#$b#METAL, BABY! $6",
  "rod.011.Platonic": "The Night Market is pretty magical, don't you think @?#$b#I might set up a booth and offer tarot readings next year, it would certainly fit with the atmosphere!$1",
  "rod.012.Platonic": "I came to see Elliott, and I had completely forgotten that the Night Market was starting today! Did you buy anything, @?",
  "rod.013": "Of course, I exercise! I love food too much!$1",
  "rod.014.Platonic": "You know, I wish I could enjoy this beach without pants sometimes.$4#$b#Tried it once and Mayor Lewis came to tell me that children come here sometimes. What a bummer.#$b#$e#What?$7",
  "rod.015.Platonic": "Isn't this event quaint? Rosa did great!$1#$b#It's good to have our own Spirit's Eve celebration in East Scarp, right?#$b#Oh don't worry, I'll be heading into town later. I want every one to see my amazing costume. Have I told you it's an official replica?$4",
 // "rod.016.Platonic": "I might visit the Night Market again. It leaves tomorrow and we won't be able to enjoy it until next year!$1", //removed in 3.0.0
  "rod.017.Platonic": "I'm considering visiting the Mermaid Boat tonight.#$b#For...$2#$b#Research purposes! Yep, that's it. I plan on telling a story about mermaids in an upcoming novel.$1#$b#That is why I want to see the Mermaid Show. Research.$4#$b#Yeah.#$e#You're still here?$7",
  "rod.018.Platonic": "The view is pretty amazing from up here, don't you think?#$b#I mean, I love the ocean view in East Scarp, but this is something else. You can see the whole valley!$1",
 // "rod.021": "Oh, I didn't expect to see you there, @. I didn't know you were a friend of Mineral Town!$1#$b#Me? Oh, just visiting my old buddy Zack!",
  "Rodney.PrideFestival": "Look at all those fabulous queer folks!$1#$b#I feel like I really found my tribe here, you know? Being a bisexual man isn't always easy and I've had partners who didn't quite accept it.#$b#My dear Annwenn never questioned it though. She loved all of me.$4#$b#Anyway, Elliott and I are workshopping queer mystery novel ideas, wanna pitch in?$1", //added in 3.1.0
  "RodneyGreenRain1": "Hello captain @. I have been conducting a thorough scan of this phenomenon. The readings from my tricorder seem to suggest that despite its impressive appearance, the green rain is harmless to humanoids.#$b#It also appears to have an enhancing effect on the local flora. With your permission, I would like to collect a few samples so I can run an in-depth analysis on the ship.", //added in 3.1.0
  "RodneyGreenRain2": "Upon further analysis, I have concluded that the inhabitants of this world are deeply rooted in superstition, which explains, in part, why they seem to be afraid of a perfectly natural, albeit unusual, weather event.", //added in 3.1.0
  "RodneyGreenRain3": "Captain. I have gathered sufficient data regarding the so-called green rain. While doing so, I may have discovered a way to harness its power to counteract the effect of the Genesis Device. I suggest we beam back to the ship without further delay and set a course for spacedock at maximum warp to present these findings to the admiral.", //added in 3.1.0

  // Schedule dialogue romantic 
  //the name of the strings has been changed in 2.0.0
  "rod.001.Romantic": "Feel the ocean breeze, sweetie, and let the energy of the Gem Sea flow through you.#$b#Now, how about you and I go skinny-dipping?$4", 
  "RodneyFreeAutographDialogue": "Hey, I know how to make your day better. Here take this!",
  "rod.007.Romantic": "Hello there my sweet farmer! That's a nice surprise. I didn't expect to see you here. I often come here to enjoy the sights.#$b#Let me know next time you feel like trekking all the way up here, we can make a date out of it!$1",
  "rod.008.Romantic": "Hello sweetie.$7#$b#Sorry, I'm not fully awake yet.$2#$b#%Rodney takes a sip of coffee.#$b#At least, I already have pants on. But maybe you were hoping otherwise?$4",
  "rod.011.Romantic": "The Night Market is pretty magical, isn't it, my love?#$b#We should set up a booth next year. I'll offer tarot readings and you can be the eye-candy to lure customers in.$1",
  "rod.012.Romantic": "I came to see Elliott, and I had completely forgotten that the Night Market was starting today! Did you get me anything, sweetie?$1", 
  "rod.014.Romantic": "You know, I wish I could enjoy this beach without pants sometimes.$4#$b#But if you and I want some privacy, we could always go to the remote beach south of Cherry Orchard and we could wear whatever we want.$4", 
  "rod.015.Romantic": "Isn't this event lovely? Rosa did great!$1#$b#It's good to have our own Spirit's Eve celebration in East Scarp, right?#$b#Oh sweetie, we should get matching costumes next year! That's way we could be the greatest power couple of the festival!$1", 
  "rod.016.Romantic": "I might visit the Night Market again. It leaves tomorrow and we won't be able to enjoy it until next year, will you join me, my love?$1", 
  "rod.017.Romantic": "I'm considering visiting the Mermaid Boat tonight.#$b#For...$2#$b#Research purposes! Yep, that's it. I plan on telling a story about mermaids in an upcoming novel.$1#$b#That is why I want to see the Mermaid Show. Research.$4#$b#Care to join me? I hear it's rather romantic.$4", 
  "rod.018.Romantic": "Hello there, sweetie! The view is pretty amazing from up here, don't you think?#$b#I mean, I love the ocean view in East Scarp, but this is something else. You can see the whole valley!$1", 
  // Movie dialogue 
  "spring.movie.0.1": "I'm not sure what to expect from this movie to be honest. I'm glad to be here with you, though!#$b#Are you they're not airing the new Stellar Skirmishes movie?$7",
  "spring.movie.0.2": "Come on brave little sapling, you can do it!$2",
  "spring.movie.0.3": "This movie was much deeper than I anticipated.#$b#What? No, I didn't cry.$8",
  "spring.movie.0.4": "Rodney's eyes are filling with tears...",
  "spring.movie.1.1": "I really enjoy documentaries. I often watch them to research topics for my books!$1",
  "spring.movie.1.2": "The views in this movie were very beautiful. I think I spotted my old house when they showed Zuzu City.",
  "summer.movie.0.1": "I can't wait to see this movie!$1#$b#I've always been fascinated by the story of the Prairie King. Did you know he actually existed?",
  "summer.movie.0.2": "Rodney is sitting on the edge of his seat.",
  "summer.movie.0.3": "Look out, Sage!$8",
  "summer.movie.0.4": "Wow. Such a great movie!$1#$b#I'm seriously considering dressing as the Prairie King next Spirit's Eve! And you could be my trusty sidekick!$1",
  "summer.movie.1.1": "Finally, this movie theater has some science-fiction for this old nerd!$1",
  "summer.movie.1.2": "I really enjoyed the movie, even though I wish it had more scenes about the regulations concerning galactic trades routes and less about gluten, you know?",
  "fall.movie.0.1": "I don't really know what this movie is about. I saw the trailer and it made me very confused.",
  "fall.movie.0.2": "Rodney looks terrified.",
  "fall.movie.0.3": "That's was an awful experience. I don't like horror movies at all. I want to go home.$2",
  "fall.movie.1.1": "I'm fairly certain I will not enjoy this movie.$2",
  "fall.movie.1.2": "Please, don't ask me to watch an horror movie with you ever again.$2",
  "winter.movie.0.1": "This movie seems nice! A cute and cozy story is exactly what we need in the dead of Winter.",
  "winter.movie.0.2": "That was a beautiful movie. Not gonna lie, I'm almost teared up when the Stardrop Fruit appeared.",
  "winter.movie.1.1": "Can you believe I've never seen this movie? I know it's a classic, so I'm glad I can finally watch it.",
  "winter.movie.1.2": "Rodney is snoring.",
  "winter.movie.1.3": "I'm terribly embarrassed...$4#$b#The movie was so boring I fell asleep!$4",
  //Villagers Autographed photo reaction
  //Like
  "Elliott.GiftReaction_An_autographed_photo": "Thank you for the kind gift, @! Even though I already have a few of those, I'm always glad to have one more so I can share them with my friends.$1",
  "Gus.GiftReaction_An_autographed_photo": "Oh thank you, @.#$b#I collect those to give them to the tourists who come into the Saloon!$1",
  "Gunther.GiftReaction_An_autographed_photo": "Thank you kindly, @. I'll make sure to put on the counter at the Museum, with the others.",
  "GuntherSilvian.GiftReaction_An_autographed_photo": "Thank you kindly, @. I'll make sure to put on the counter at the Museum, with the others.$1",
  "Leah.GiftReaction_An_autographed_photo": "Great gift, @!#$b#I'm collecting those for a little art project...$4",
  "Sophia.GiftReaction_An_autographed_photo": "Is that a genuine autographed photo of two-time award winner, author Rodney O'Brien?$5",
  "Haley.GiftReaction_An_autographed_photo": "Oh thanks! I don't like Rodney's books, they're for nerds... but a real autograph from a two-time award winner? I like it.",
  "Olivia.GiftReaction_An_autographed_photo": "That's a very nice gift, thank you, dear.$1",
  //Neutral
  "Susan.GiftReaction_An_autographed_photo": "I... that's nice, but I already have a few of those.",
  //Dislike
  "Abigail.GiftReaction_An_autographed_photo": "Oh come on, Rodney keeps on handing me those.$5",
  "Emily.GiftReaction_An_autographed_photo": "I appreciate the intention, but please, keep it to yourself next time. I don't need more.$3",
  "Evelyn.GiftReaction_An_autographed_photo": "Oh that's very kind of you, but I don't really need it.",
  "George.GiftReaction_An_autographed_photo": "Not this again.$2",
  "Harvey.GiftReaction_An_autographed_photo": "I had hoped Rodney had handed all of his stock, but it appears that there's more...$5",
  "Jas.GiftReaction_An_autographed_photo": "No, thank you.$3",
  "Shane.GiftReaction_An_autographed_photo": "I'm sick of seeing that guy's face everywhere.$2",
  "Vincent.GiftReaction_An_autographed_photo": "I don't like this.$2",
  "Alex.GiftReaction_An_autographed_photo": "Don't bother giving this to people, just throw it in the trash where it belongs.$5",
  "Caroline.GiftReaction_An_autographed_photo": "I like Rodney, but I don't really want his picture.$2",
  "Willy.GiftReaction_An_autographed_photo": "Instead of gifting this to me, you should recycle it! I keep finding those stuck in my crab pots!$2",
  "Linus.GiftReaction_An_autographed_photo": "This reminds me of the futility of that man's work...$2",
  "Jodi.GiftReaction_An_autographed_photo": "Oh. Thank you, I guess. I'm just going to put this in my pocket. For safekeeping.$2",
  "Kent.GiftReaction_An_autographed_photo": "That guy.$2",
  "Krobus.GiftReaction_An_autographed_photo": "Do you not respect me? Why do you try to give me your trash?$2",
  "Marnie.GiftReaction_An_autographed_photo": "Oh. I'll hang this in the coop, the chickens might enjoy it.$2",
  "Maru.GiftReaction_An_autographed_photo": "I'm not a fan of Rodney's work. It care about science too much to respect his so-called science fiction.$2",
  "Penny.GiftReaction_An_autographed_photo": "I could use this as a bookmark, I suppose...$2",
  "Pierre.GiftReaction_An_autographed_photo": "I don't like this. Rodney keeps trying to pay me with it. He once tried to trade one for a bottle of vinegar for some reason.$3",
  "Robin.GiftReaction_An_autographed_photo": "This would make good compost, I suppose.$2",
  "Sam.GiftReaction_An_autographed_photo": "Oh great, another of those.$5",
  "Sandy.GiftReaction_An_autographed_photo": "If you had given me a rock you found outside on the ground, I would have been happier.",
  "Leo.GiftReaction_An_autographed_photo": "I don't like the look on that man's face.$2",
  //Hate
  "Lewis.GiftReaction_An_autographed_photo": "I can't. Not anymore, please. Make it stop.$5",
  "Wizard.GiftReaction_An_autographed_photo": "What is this buffoonery?",
  "Clint.GiftReaction_An_autographed_photo": "Thank you, but not thank you. I don't like that man, he's mean.$3",
  "Pam.GiftReaction_An_autographed_photo": "Listen, Rodney's an okay dude, but I'm drowning in those photos. I don't want them.$4",
  "Demetrius.GiftReaction_An_autographed_photo": "No.$4",
  "Dwarf.GiftReaction_An_autographed_photo": "What in the Void in that?",
  "Marlon.GiftReaction_An_autographed_photo": "What am I supposed to do with it? Hang it in the mines to scare the monsters away?",
  "MarlonFay.GiftReaction_An_autographed_photo": "What am I supposed to do with it? Hang it in the mines to scare the monsters away?",
  "Andy.GiftReaction_An_autographed_photo": "I guess I'll use this as fuel next time I need to start a fire.$2",
  "Victor.GiftReaction_An_autographed_photo": "Wow. No thank you.$2",
  "Lance.GiftReaction_An_autographed_photo": "What do you want me to do with that?$3",
  //Mobile phone
  "MobilePhoneGreeting": "Two-time award winner, author Rodney O'Brien speaking. Oh, hi!",
  "MobilePhoneReminisce": "I think I remember... but what was it again?",
  "MobilePhoneGoodBye": "Have a good one farmer!",
  // Wizard gender for Rasmodia compatibility
  "WizardFemale": "witch",
  "WizardMale": "wizard",
  "WizardHer": "her",
  "WizardHis": "his",
  //Villagers conversation topics dialogue
  "Elliott.TalkWithGunther": "Did you meet my uncle Rodney?#$b#I am glad he moved to the Valley, but his coaching of my writing is...#$b#...invasive.$2",
  "Elliott.MeetingMeredith": "How cool is Meredith? She and I pretty much grew up together. My parents often dropped me at Uncle Rodney and Aunt Annwenn's place.#$b#Don't tell him, but Uncle Rodney is the one who inspired me to start writing.$4",
  "Elliott.RodStoryReading": "I read Uncle Rodney's new short story. I like it very much. Thank you for helping find inspiration again.#$b#With a bit of luck, that will keep him busy enough and he'll stop coaching my writing.$2",
  "Elliott.BookLaunchParty": "How great was the Book Launch Party for The Chronicles of Stardew Valley?$1#$b#I'm looking forward to having many of those for all of my books!",
  "Elliott.LibraryTalk10HP2": "I'm happy we're all going to visit the Ferngill National Library. It's a very beautiful place. I used to visit quite often when I lived in the city.",
  "Elliott.FerngillNationalLibraryReading": "I'm so very proud of my Uncle Rodney. After everything he's been through, he really deserves the success of his new book and the recognition that goes with it.",
  "Gus.TalkWithGunther": "I heard you met Rod!$1#$b#He's a good friend! You won't run into him at the saloon at night, though. But he often visits for lunch!",
  "Gus.MeetingMeredith": "I'm glad you dropped by when Meredith was there. She's a good kid, but she tends to drive her old man nuts. I'm sure he appreciated the company.",
  "Gus.RodStoryReading": "Before you ask, yes, I read Rod's story and I loved it.$1",
  "Gus.BookLaunchParty": "Did you enjoy the party I threw for Rod? He didn't want to invite everyone, but he told he was glad so many people were there.",
  "Gus.LibraryTalk10HP2": "Group trip to Zuzu City!$1#$b#Do you think we could meet the Queen of Sauce after we go to the National Library?",
  "Gus.FerngillNationalLibraryReading": "My boy Rod did great during his big event at the National Library, don't you think?$1",
  "Gunther.ShadowfolkStory": "Rodney came by this morning. He wanted every book I have in stock about the Shadow People.",
  "Gunther.DwarfStory": "Rodney came by this morning. He wanted every book I have in stock about the Dwarves. I don't have much, but he took 'Mysteries of the Dwarves' by M.Jasper.",
  "Gunther.RodStoryReading": "Oh you read Rodney's short story too? It was very well done. Just enough fantasy and folklore elements for my taste. Not too magical.",
  "Gunther.BookLaunchParty": "The Book Launch party was a great success! And the good reviews will help Rodney focus on his creativity instead of his anxiety.",
  "Gunther.FerngillNationalLibraryReading": "I visited the Ferngill National Library a few times in the past and I still really enjoy it. They have a very complete collection.",
  "GuntherSilvian.ShadowfolkStory": "Rodney came by this morning. He wanted every book I have in stock about the Shadow People.",
  "GuntherSilvian.DwarfStory": "Rodney came by this morning. He wanted every book I have in stock about the Dwarves. I don't have much, but he took 'Mysteries of the Dwarves' by M.Jasper.",
  "GuntherSilvian.RodStoryReading": "Oh you read Rodney's short story too? It was very well done. Just enough fantasy and folklore elements for my taste. Not too magical.",
  "GuntherSilvian.BookLaunchParty": "The Book Launch party was a great success! And the good reviews will help Rodney focus on his creativity instead of his anxiety.",
  "GuntherSilvian.FerngillNationalLibraryReading": "I visited the Ferngill National Library a few times in the past and I still really enjoy it. They have a very complete collection.",
  "Leah.MeetingMeredith": "Elliott came by my house the other day with his cousin Meredith.#$b#I showed her a a few sculptures and paintings and she loved them so much that she commissioned me!$1",
  "Leah.RodStoryReading": "Did you get to hear Rodney's short story?#$b#I did and I really liked it, even though I wish he would have gone with a story about the fairies that live in the Forest.",
  "Leah.BookLaunchParty": "I don't remember seeing Rodney as happy as he was during the Book Launch Party!$1",
  "Leah.FerngillNationalLibraryReading": "I really loved our visit to the Ferngill National Library. I hope to visit again soon!$1",
  "Leah.RodneyBirthaySuit": "So... Do you think I should ask Rodney to pose for a painting?$4",
  "Abigail.BookLaunchParty": "That party for Rodney's book was cool, even though Mom got weird about it afterwards.",
  "Emily.TalkWithGunther": "Oh, have you met Rodney? Isn't it exciting to have a famous writer living in Pelican Town?$1",
  "Emily.BookLaunchParty": "I'm very happy for Rodney. He deserves the success of his book.$1",
  "Harvey.RodStoryReading": "I'm a bit worried about Rodney.$2#$b#I told him his wrist needed time to heal and he told me that inspiration wouldn't wait on his body...#$b#Artists...$2",
  "Harvey.BookLaunchParty": "I read most of The Chronicles of Stardew Valley. It's very well written and entertaining.$1",
  "Shane.BookLaunchParty": "I can't believe my Friday night at the Saloon got ruined by this guy's stupid book party.$2",
  "Caroline.BookLaunchParty": "What? No, I didn't read Rodney's book and I don't intend to. It's just a bunch of gossips and silly legends.$3",
  "Jodi.TalkWithGunther": "I ran into that writer the other day. Rodney, I think. He seems nice and he's pretty easy on the eyes.$1",
  "Jodi.RodneyBirthaySuit": "I heard you walked in on Rodney exiting the shower...#$b#How was it?$1",
  "Krobus.ShadowfolkStory": "The human they call Rodney is writing a story of my people. I hope he doesn't portray harmful stereotypes.",
  "Penny.TalkWithGunther": "Mister O'Brien is very nice, don't you think? He's spends a lot of time at the Library and he offered to give the kids a creative writing lesson!$1",
  "Penny.BookLaunchParty": "I'm a bit disappointed I didn't attend Rodney's book launch party.$2#$b#He gifted me an early copy of the book and I was so absorbed by it that I forgot to go to the Saloon!$4",
  "Pierre.BookLaunchParty": "That Rodney man is a joke. I don't like him very much and I don't intend on reading his book.$3",
  "Lewis.TalkWithGunther": "Oh, you met our resident two-time award winner, author Rodney O'Brien?$2#$b#If he asks about Pelican Town being a 'thriving naturist community', the official answer is that it was a typo.$2",
  "Lewis.BookLaunchParty": "Great turnout at Rodney's book launch party! Such a book will definitely boost tourism in the Valley.$1",
  "Lewis.FerngillNationalLibraryReading": "I'm happy Rodney decided to donate the monetary prize he got from the Ferngill National Library to our own Museum & Library, but I wish he had told me beforehand.#$b#If the donation was made to Pelican Town, I could have used it for other projects for the town.$2",
  "Lewis.RodneyPoetryReading": "I got a lot of complaints from the inhabitants of East Scarp about Rodney yelling poetry on his balcony in the middle of the night.#$b#That man is impossible.$2",
  "Wizard.RodStoryReading": "You know the writer called Rodney O'Brien? He keeps coming to my tower claiming he wants to do 'some research for a book'.#$b#I don't have time for such mundane business.",
  "Wizard.RodneyPoetryReading": "Rodney O'Brien visited me again, asking if he could read poetry from the roof of my tower.",
  "Clint.BookLaunchParty": "I came to the Saloon to have a drink and I ended up in Rodney's party.#$b#I did not enjoy it.$3",
  "Pam.BookLaunchParty": "I probably won't read Rodney's book, but I'm happy for him. Mostly.",
  "Pam.RodneyBirthaySuit": "So you're walking into people's house without knocking to see them naked?$4",
  "Demetrius.RodStoryReading": "Rodney thinks because I'm a scientist, I love science-fiction. That's actually a pretty common misconception. I appreciate science and fiction, but I don't like when the two intertwine.",
  "Demetrius.FerngillNationalLibraryReading": "I heard you visited the Ferngill National Library. I really like going there. It is the ultimate repository of knowledge in the Ferngill Republic.",
  "Marlon.RodStoryReading": "That Rodney man wants me to escort him through the mines to do some research for a book.#$b#Of course, I told him no. I'm not a babysitter.",
  "MarlonFay.RodStoryReading": "That Rodney man wants me to escort him through the mines to do some research for a book.#$b#Of course, I told him no. I'm not a babysitter.",
  "Haley.MeetingMeredith": "I met a new girl in town and I absolutely loved her style! I think her name was Meredith or something?",
  "Dwarf.DwarfStory": "The tall man with a polished head came by the mine recently. He kept yelling 'Is there a dwarf out there? I need an answer for my book!'.#$b#I don't trust him.",
  // Events
  // Intro library event
  "event-134371008.01": "Welcome!",
  "event-134371008.02": "Hello @! Came to visit Pelican Town's trendiest location?$1",
  "event-134371008.03": "He means the library. I'll be with you in a second, @.#$b#Rodney, I'm sorry I don't have the books you requested here. I'll reach out to the Grampleton Library to see if they have them, okay?",
  "event-134371008.04": "Thank you so much, Gunther. You're a life saver!$1#$b#Well, I'm gonna go and browse the collection. See you around farmer!",
  "event-134371008.05": "$y 'That man is such a book worm. What do you think about Rodney?_He's a nice guy, I guess._He is, isn't he? The people around here don't really come talk to me that much, except you of course. But Rodney always has some time to chat._I think he's full of himself._Well, that's a bit harsh, but I can see how he could give that impression at first. He does have a bit of an ego. Give him time and hopefully you'll come to think of him as a friend, like I do.", //changed in 2.0.0
  "event-134371008.06": "Anyway, I have to get back to work, did you need something?",
  //Farm event
  "event-134371001.01": "Hey you! You're finally awake!", //changed in 2.0.0
  "event-134371001.02": "I walked all the way from East Scarp and let me tell you, that's quite the hike!#$b#There's something I would like to have your opinion on. See, I'm working on a new book!$1#$b# It's a collection of short stories inspired by things I've seen or heard since I've moved to the Valley.#$b#I've discussed the local legends with Gunther quite a lot and I want to write a story based on those!#$b#So, tell me, which story would you rather read?",
  "event-134371001.03": "What story is the most appealing to you?",
  "event-134371001.04": "The adventure of a Dwarf, the last of his kind, who's trying to find a long-lost artifact to bring his people back.",
  "event-134371001.05-0": "The story of a Shadowfolk who embarks on an adventurous journey to lift the Curse that was once cast on his people by an evil ",
  "event-134371001.05-1": ".",
  "event-134371001.06-0": "That is an interesting choice! I don't know much about the Shadow Folk, so I'll have to do some more research. I might visit the ",
  "event-134371001.06-1": " to get some information.$1#$b#Thank you for your help @, I better get going, I have some writing to do!$1#$b#Have a glorious day!$1",
  "event-134371001.DwarfStory.01": "That is an interesting choice! I may need to venture into the local mines in order to do some research!$1#$b#Thank you for your help @, I better get going, I have some writing to do!$1#$b#Have a glorious day!$1",
  // Meeting Meredith
  "event-134371002.01": "Come on, cuz. There's more to theatre than the complete works of Warwick Stirlance! He was visionary, but that was four hundred years ago!", //changed in 2.0.0
  "event-134371002.02": "What can I say? I love the classics. And you can't deny his talent, Meredith! He's The Poet!", //changed in 2.0.0
  "event-134371002.03": "Welcome!",
  "event-134371002.04": "Please join us!",
  "event-134371002.05": "Hello @! How are you today? Let me introduce you to my beloved offspring, Meredith.$1",
  "event-134371002.06": "Hi. I'm Meredith O'Brien. You must be the farmer my father told me so much about.",
  "event-134371002.07": "Hahaha, don't mind Meredith, she's always exaggerating.$4#$b#Anyway, Meredith came to visit for the day, so we're enjoying a family lunch!$1",
  "event-134371002.08": "Yes! We were in the middle of a heated discussion about the theatre.$1#$b#You see, I was part of a theatrical troupe in college and Meredith is studying at the Ferngill National School of the Arts.", //changed in 2.0.0
  "event-134371002.09": "I know that theatre is not my father's forte, he prefers the movies! But what do you think farmer @?", //changed in 2.0.0
  "event-134371002.10": "Gus! Another beer!",
  "event-134371002.11": "Uncle Rodney, I wanted to show Meredith the progress on my novel, would you excuse us?",
  "event-134371002.12": "Coming right up, Pam!",
  "event-134371002.13": "...$2#$b#Of course! You kids have fun.$1",
  "event-134371002.14": "Thanks Dad! Meet us later, okay?",
  "event-134371002.15": "Thanks a lot for saving me @. I enjoy spending quality time with my daughter, but when she and Elliott are together, they get so intense about stuff, you know?", //changed in 2.0.0
  "event-134371002.16": "Here you go, Pam.",
  "event-134371002.17": "Don't get me wrong, I'm thrilled Meredith decided to visit!$1",
  "event-134371002.18": "And two cups of joe, on the house!$1",
  "event-134371002.19": "Thanks Gus!$1#$b#... $2",
  "event-134371002.20": "What is it, Rod? I thought you'd be ecstatic today, with your baby girl visiting you and all.",
  "event-134371002.21": "I am, it's just that... I feel lost sometimes. She's not my baby girl anymore, she's a grown woman now, and she doesn't really need her old man, does she?$2",
  "event-134371002.22": "Nonsense! You've been taking care of that girl on your own for what? Fifteen years?#$b#Yes, she's an adult, which means you can rest for a bit, but don't fret, she'll be running back to her dad at the first sign of trouble!$1",
  "event-134371002.23": "I guess you're right.$1",
  "event-134371002.24": "Well, I better be on my way to check on the kids! Thanks a lot, to you both!$1",
  "event-134371002.25": "Do you like theatre?", //changed in 2.0.0
  "event-134371002.26": "Yes, I love it!",
  "event-134371002.27": "You mean, like musical theatre? If so, yes!", //changed in 2.0.0
  "event-134371002.28": "Why bother with the theatre when I own a TV?", //changed in 2.0.0
  "event-134371002.29": "Oh great, I'd love to hear about your favourite plays someday.$1", //changed in 2.0.0
  "event-134371002.30": "Yes, I suppose.$2", //changed in 2.0.0
  "event-134371002.31": "No wonder why you and my Dad are friends.$3", //changed in 2.0.0
  "event-134371002.32": "What do you think, farmer?",
  "event-134371002.33": "I agree with Gus, she may need her space, but you'll always be her father.",
  "event-134371002.34": "Well, I think she's mean.",
  "event-134371002.35": "Thanks @, that means a lot to me.$4",
  "event-134371002.36": "Ah! She can be a brat, I give you that!$1",
  //ShadowfolkStory
  "event-134371003.01": "Hello @ and welcome to my humble abode!$1#$b#I'm so glad you came by, I just finished writing a scene from a short story, and I'd like to read it to you.",
  "event-134371003.02": "Come closer!",
  "event-134371003.03": "OK! It starts in a mysterious cave...",
  "event-134371003.04": "Our brave hero had never ventured this deep into the caves. This cavern had been untouched for centuries and here he was, alone and scared.",
  "event-134371003.05": "But, he was a member of the Shadowfolk, a proud and brave people. He was not about to let darkness get the best of him!",
  "event-134371003.06": "He felt the presence of the scroll before seeing it. A scroll which carried an incredible power! Destroying it would allow our hero to lift the Curse on his people!",
  "event-134371003.07-0": "But alas, the Evil ",
  "event-134371003.07-1": ", who had cursed the Shadowfolk so long ago, had felt the presence of our hero in ",
  "event-134371003.07-2": " hidden vault.",
  "event-134371003.08-0": "'What do you think you're doing?' the ",
  "event-134371003.08-1": " asked.#$b#'Releasing my people from your Yoba damned curse and sending you back to the Void where you belong!' our hero replied.",
  "event-134371003.09-0": "'Please, oh mighty Shadow Brute, spare my life and I will grant you everything you want!' the ",
  "event-134371003.09-1": " begged, knowing that the dragon tooth was powerful enough to destroy the scroll, lift the curse and banish any soul to the Void for eternity...",
  "event-134371003.10": "'I'm not a Shadow Brute' our hero said. 'I am the Hero of the Shadow Folk and my name is @!'",
  "event-134371003.11-0": "'Never forget, ",
  "event-134371003.11-1": ". @ beat you.'",
  "event-134371003.12": "And, that's it! I really hope you liked it. Of course, it's only the last scene from the story. I have already written how @ finds the dragon tooth. And, keep in mind that it's the first draft. I need to let it rest for a few days and edit it a lot before I can send it to my publisher.#$b#I think I'm going to rest now.$1#$b#Thanks a lot @ for inspiring me to write this story!$1",
  "event-134371003.13-0": "'Did you really believe you could access this place without my knowledge you foolish creature?' the ",
  "event-134371003.13-1": " said. 'I created this place specifically to prevent any of you, Shadow brutes, to lift the Curse. You can access it, you can even read the scroll, but there is nothing more you can do!'",
  //DwarfStory
  "event-134371003.21": "Hello @ and welcome to my humble abode!$1#$b#I'm so glad you came by, I just finished writing a scene from a short story, and I'd like to read it to you.",
  "event-134371003.22": "Come closer!",
  "event-134371003.23": "OK! It starts in a mysterious underground complex...",
  "event-134371003.24": "Our brave hero had never ventured this deep under the mountain. They were the first of their kind to enter this place in centuries. This was no ordinary cave, this was the ruins of an ancient outpost of the Smoluanu. And there they were, all alone.",
  "event-134371003.25": "Everything was in shambles. Broken machines were everywhere and it looked as if the Smoluanu had left in a hurry. But our hero was not about to let this discourage them. They had been searching for this place for decades.",
  "event-134371003.26": "The answers must be out there, our hero thought. They have to.",
  "event-134371003.27": "The pool of lava confirmed what our hero had believed deep in their heart. The Smoluanu ran out of time and were destroyed before completing their mission.",
  "event-134371003.28": "They had abandoned all of hope when they felt something. A presence they hadn't felt in years.",
  "event-134371003.29": "The spirits of the Smoluanu meant what our hero didn't want to believe. That they were already one with the Moon.#$b#'Don't cry, @' said one of the spirits. 'We are at peace now. The Elemental Wars took their toll on the Smoluanu but there is still hope for you.'",
  "event-134371003.30": "'There is no hope in loneliness' replied our hero. 'I am the last of the Smoluanu to roam this Yoba forsaken planet and my death will mean the end of our kind.'#$b#'You have always been one for drama, @' the spirit replied. 'There is hope for you. You can rejoin the Smoluanu who made it back to the Moon.'",
  "event-134371003.31": "'Behold, @. The last vessel of the Smoluanu. It was hidden here centuries ago, in case someone was left behind. Now rejoice @ and take to the sky. Boldly go, my dear @. For us all.'",
  "event-134371003.32": "@ knew what they had to do. They would grieve later, now was the time to go home!",
  "event-134371003.33": "Finally, after what had felt like a lifetime of searching, @ was going home...",
  "event-134371003.34": "And, that's it! I really hope you liked it. Of course, it's only the last scene from the story. I have already written how @ finds the location of the outpost. And, keep in mind that it's the first draft. I need to let it rest for a few days and edit it a lot before I can send it to my publisher.#$b#I think I'm going to rest now.$1#$b#Thanks a lot @ for inspiring me to write this story!$1",
  //SaloonParty
  "event-134371010.01": "@! You came!$1",
  "event-134371010.02": "What is going on here tonight?",
  "event-134371010.03": "I just came for a drink.",
  "event-134371010.04": "So this was supposed to be a small event with only a few close friends and family and SOMEONE decided to invite half the town. And make a banner. And somehow already had a framed portrait of me.$7",
  "event-134371010.05": "Isn't he gonna make a speech?",
  "event-134371010.06": "I'm bored.",
  "event-134371010.07": "I'm sorry, Rod. I just wanted everyone to celebrate with us!$1",
  "event-134371010.08": "And trust me Gus, I appreciate it.#$b#This is just a bit much. What if everyone hates my book? I'm not ready to go through that again.$2",
  "event-134371010.09": "What are we waiting for?",
  "event-134371010.10": "Now now, Rodney. Your book is great. And everyone will enjoy it. Since @ arrived, would you like to do your speech?",
  "event-134371010.11": "Alright then. Let's get this show started.",
  "event-134371010.12": "Listen up everybody!",
  "event-134371010.13": "I would like to thank you all for coming tonight to celebrate the launch of my new book: The Chronicles of Stardew Valley.",
  "event-134371010.14": "Moving into this valley to get inspiration was a suggestion from my dear nephew Elliott and I don't know if I can thank him enough for that.#$b#This place made me feel like a new man and thanks to the people of Pelican Town, I found my muse again.$1#$b#What I'm trying to say is... thank you. To all of you.$4",
  "event-134371010.15": "Even me?",
  "event-134371010.16": "Yes Pam, even you.$7#$b#Now, my nephew has gathered the early critiques for the book. Elliott, will you come forward please?",
  "event-134371010.17": "Of course, uncle Rodney!",
  "event-134371010.18": "It's my great pleasure to read to all of you a few critiques that my uncle's new book, The Chronicles of Stardew Valley has received!",
  "event-134371010.19": "Finally!",
  "event-134371010.20": "I can't wait!",
  "event-134371010.21": "This is from The Zuzu City Times. 'It has been years since the publishing world heard of award winning author Rodney O'Brien and he comes back with a bang!'$1#$b#'The Chronicles of Stardew Valley is one of those little jewels that will get you hooked from start to finish.'",
  "event-134371010.22": "Congratulations, dad!",
  "event-134371010.23": "This one is from the Ferngill Literary Journal. 'We never believed that Rodney O'Brien would be able to publish anything other than science fiction. And that man was apparently decided to prove us wrong.'#$b#'In his new book, the author takes to a quaint part of the Ferngill Republic and shares with us some beautiful short stories about topics as diverse as a mythical creature trying to find his home, a wizard fathering a child with an innocent woman, the life of a newly established farmer or the sad love life of a struggling blacksmith. And he tells it beautifully.'",
  "event-134371010.24": "Thank you Elliott! Now, let's get this party started, alright?$1#$b#Enjoy the food and drinks, they're on us! Oh and my publisher was kind enough to send me some copies of the new book so feel free to grab one!$1",
  "event-134371010.25": "You heard the man, let's get this party started!",
  "event-134371010.26": "Finally, I'm starving!",
  "event-134371010.27": "I'm not hungry anymore.",
  "event-134371010.28": "Thank you so much for coming @. It means a lot!$1#$b#No, Pam what are you doing with this burger?$8",
  //Flashback event 10HP1
  "event-134371011.01": "Come in!",
  "event-134371011.02": "Hello @. How are you today?$2",
  "event-134371011.03": "Me? Oh I'm sorting some old books. I moved up a few things that have been gathering dust in the basement.#$b#I stumbled upon this book. I didn't remember I still had a copy.",
  "event-134371011.04": "Rodney shows you the book he was reading before. It's titled 'Arcana Catcher: Prunus' by Rodney O'Brien.",
  "event-134371011.05": "This book was different than anything I had ever written. It performed terribly and...",
  "event-134371011.06": "Let me tell you the story.",
  "event-134371011.07": "When I was a much younger man, I lived a pretty idyllic life. I found true love and I was able to make a living writing stories.#$b#And I had my baby girl.",
  "event-134371011.08": "Meredith loved magical girls stories when she was a kid, and I wanted to connect with her. Step out of my comfort zone. So I started writing.#$b#This was the story of Prunus, a young girl from Zuzu City. One night, she went into her father's study, a place she was not allowed in. She looked at everything, books, files and every little knick-knacks and trinkets.#$b#The girl was very disappointed. Why wasn't she able to visit this place if nothing of value was in it?#$b#When she was about to give up and go back to bed, she noticed a crooked painting on the wall. Quietly, she moved towards it and there it was: hidden behind a painting like in a mystery book, her father's safe.#$b#And the key was on it! She opened the safe and inside it was a big ancient grimoire.#$b#She struggled to open the book, like it wanted to remain untouched. She finally managed to open it and then, it fell on the floor.#$b#Rays of light and sparkles flew out in every direction from the old tome. When everything settled, she closed the book, stuck it back in the vault and went straight to bed, pretending nothing happened.#$b#The next morning, a strange chicken-like creature came to her telling her she had released the power of the Clamp Arcanas on the world and she needed to catch them all to save the world and become the very best, like no one ever was. Also, her father was missing.#$b#This how she became, Arcana Catcher: Prunus.",
  "event-134371011.09": "This book was a total failure. My publisher accepted to do a limited print, but was very reluctant. The press hated it. My fans were disappointed in me. I even got the Worst Fantasy Novel of the Decade Award for it...$2#$b#It didn't really matter. At least, not for long.$2",
  "event-134371011.10": "My beloved Annwenn was the light and soul of our family. She had been supporting my writing career from the start. She believed this nerdy college student could make it as a writer. She was a wonderful mother to Meredith. I struggled when becoming a parent and truth be told, the only reason we had kids was because Annwenn told me it would be alright.#$b#I didn't really want to become a father, at first.#$b#A few weeks after Prunus was released, on the day after Meredith's tenth birthday, Annwenn died in her sleep.$2#$b#I woke up one morning and she was laying dead in our bed.$2#$b#...$2",
  "event-134371011.11": "Turns out Annwenn was suffering from a fatal heart condition. She left me a letter you see. She didn't want to tell me because she believed I would have abandoned my career to take care of her.$2#$b#She was damn right. I would have done that.$5",
  "event-134371011.12": "At that time, I felt like my whole world collapsed. I wanted to give up on everything and I would have, if it wasn't for Meredith. So, I quit writing and I focused on raising her as a single father.#$b#A widower.$2#$b#We had a couple difficult years, but we became our own family. A family of two.",
  "event-134371011.13": "I understand why Annwenn did what she did, but I'm still sad. I would have loved to spend her last days doing the things she loved. We could have traveled, as a family, you know?$2#$b#Meredith and I ended up okay, I think. And now, I feel like I can go on with my life. It's about time after fifteen years, don't you think @?",
  "event-134371011.14": "We're gonna be okay.",
  "event-134371011.15": "Thank you for listening to me, @. You're a good friend.",
  //LibraryTalk 10Hp2
  "event-134371013.01": "Can we start soon?",
  "event-134371013.02": "It will be quick, I promise!",
  "event-134371013.03": "You're here, great!",
  "event-134371013.04": "Perfect, now that @ is here, I can start. I'll make it quick, I know you're all very busy.#$b#I received a letter from the Ferngill National Library a few days ago. They want to host a public reading of The Chronicles of Stardew Valley.",
  "event-134371013.05": "It really is! They also said something about a monetary prize, but I don't really care about that.$1",
  "event-134371013.06": "I...$2#$b#My last public appearance as a writer was more than fifteen years ago and...$2#$b#...I'm a bit afraid of going there by myself. So... would you all come with me?$2#$b#That would mean the world to me!$4",
  "event-134371013.07": "Of course!",
  "event-134371013.08": "Sure thing, Uncle Rodney!",
  "event-134371013.09": "Yes! Group trip to Zuzu City! The National Library is a very beautiful and inspiring place, I'm happy to visit again!$1",
  "event-134371013.10": "What about you @?",
  "event-134371013.11": "That's settled then! I'll mail you the details soon! Thank you, my friends!$1",
  "event-134371013.12": "I should be able to clear my schedule for such a trip.",
  "event-134371013.13": "That's a great honour!",
  //Library reading 10hp3
  "event-134371014.01": "We're gonna be late.",
  "event-134371014.02": "Great, you're here! The others took the previous bus. Let's go!",
  "event-134371014.03": "Here we are! I haven't been here in years. It was my favourite place in the city, growing up.#$b#Come on, let's go, @!",
  "event-134371014.04": "It's a lovely place, isn't it?",
  "event-134371014.05": "Everyone should already be in place. The Curator told me that it was not too crowded, which to be honest, makes me feel better.",
  "event-134371014.06": "Let's go!",
  "event-134371014.07": "Okay, my turn!",
  "event-134371014.08": "Yeah for Rod!",
  "event-134371014.09": "Go uncle Rodney!",
  "event-134371014.10": "Hello everyone. I am very honored to be inside the beautiful National Library of the Ferngill Republic. It has been years since I met my readers in a public event and I'm glad to be back.#$b#I...$2",
  "event-134371014.11": "Breathe Dad, you can do it!",
  "event-134371014.12": "When I was asked to come here, I was told I would receive the Ferngill National Book Award for Fiction.",
  "event-134371014.13": "I turned it down. Because I'm not writing for awards. I'm writing because my head is full of stories I want to share with the world.#$b#That award comes with prize money... which I have decided to donate to the Stardew Valley Museum & Library.",
  "event-134371014.14": "Way to go, Rodney!",
  "event-134371014.15": "I'm not saying this in front of you all to boost my ego.$4#$b#I'm doing it because I know how important libraries are for local communities. Whether they're a huge library like this one, a bus filled with books or a quaint little Museum that doubles as a public library, we all need those places to learn, educate ourselves and enjoy stories.#$b#Anyway. You all came for a public reading of my latest book so let's get to it!$1",
  "event-134371014.16": "The Chronicles of Stardew Valley...",
  "event-134371014.17": "The reading went great. Rodney signed copies of his book afterwards. He seems happy.",
  "event-134371014.18": "Thank you for being there for me, @. You're a good friend.$1#$b#You helped me defeat my writer's block and for that, I am forever in your debt.$4#$b#I'm looking forward to what comes next, don't you @?$1",
  "event-134371014.19": "Here we go...",
  //Random pants event
  "event-134371007.01": "CAN'T YOU KNOCK?$5",
  "event-134371007.02": "Why are you still here?$5",
  "event-134371007.03": "Can't even be naked at home...",
  // Poetry reading event
  "event-134371017.01": "Okay, here we go.",
  "event-134371017.02": "My dear East Scarpians, it is I, your beloved neighbour and two-time award winner, author Rodney O'Brien!#$b#On this fair night, I would like to read a poem I just wrote.",
  "event-134371017.03": "Good night stars. Say good night! As I clasp my hands and grieve. A dream lost in the years. Your feelings lost in life's constant toll. I am only your love.",
  "event-134371017.04": "Thank you dear people of East Scarp. I have another one if you are interested!",
  "event-134371017.05": "Savages.",
  "event-134371017.Rosa.PoetryReaction": "Ugh Rodney... there's a time and place for everything. And after midnight ain't it!",
  "event-134371017.Jacob.PoetryReaction": "Please Rodney, we're trying to sleep.",
  "event-134371017.Aideen.PoetryReaction": "What uncouth wastrel would disrupt the peace at such an ungodly hour?",
  "event-134371017.Mateo.PoetryReaction1": "Honey, please - ",
  "event-134371017.Josephine.PoetryReaction": "Oh My, what an impressive performance! Your voice really resonates!#$b#Ever considered the stage? I have a friend in the industry, if you're interested!",
  "event-134371017.Sen.PoetryReaction": "*Gives a one man standing ovation.*$7",
  "event-134371017.Void.PoetryReaction": "What did he say? I can't hear, it's too dark outside.",
  "event-134371017.Lavril.PoetryReaction": "...Good night, stars.$19",
  "event-134371017.Tristan.PoetryReaction": "Congratulations Rodney, you scared all the monsters away. Thanks!",
  "event-134371017.Mateo.PoetryReaction2": "Rodney, go the hell to sleep.",
  "event-134371017.Dylan.PoetryReaction1": "Some of us are trying to actually get some sleep.",
  "event-134371017.Eli.PoetryReaction": "Are you gonna read us a bedtime story?",
  "event-134371017.Dylan.PoetryReaction2": "Don't encourage him!",
  "event-134371017.Barron.PoetryReaction": "What a wonderful writer...",
  "event-134371017.Trace.PoetryReaction": "You go dude, sleep is for the WEAK.",
  "event-134371017.Yri.PoetryReaction": "How does he even manage to be THAT loud?",
  "event-134371017.Plum.PoetryReaction": "I would stick around, but I've heard it all before and I'm sure I will hear it again.$3",
  "event-134371017.Henry.PoetryReaction": "......",
  "event-134371017.Sterling.PoetryReaction": "If this wakes up Mia, we're dead.",
  "event-134371017.Sondra.PoetryReaction": "Oh, goodness, at this hour? Great effort and intonation, at least, Mr. O'Brien!$9",
  "event-134371017.Sigurd.PoetryReaction": "Go on then, Rodney, give us another!$18",
  "event-134371017.Gunnar.PoetryReaction": "How come the stars get to sleep and I get woken up?$7",
  "event-134371017.Gudrun.PoetryReaction": "I have an EXAM in the morning! Are you TRYING to make me fail?$5",
  "event-134371017.Teren.PoetryReaction": "You're louder than any drill sergeant I've ever known, how?$9",
  //Beach event with Oliver
  "event-134371016.01": "What a beautiful day.",
  "event-134371016.02": "Oh hey kiddo. You're the Governor's son, right? Oliver was it?",
  "event-134371016.03": "Yep, that's me. And you're Rodney O'Brien, right? You're like a famous author!#$b#It's cool to meet you.",
  "event-134371016.04": "How can I help you on this beautiful day?",
  "event-134371016.05": "Well, actually, I'm a fan of your work. I read all the Deference Arlington Saga and it's pretty cool, but...",
  "event-134371016.06": "But you want some more, right?$1#$b#Well, you read the last volume. You know she can't come back!",
  "event-134371016.07": "Well actually, in the previous book, you say that the Otter wormhole on the edge of the Teo-2 system leads to the other side of the Universe, correct?",
  "event-134371016.08": "Yes...",
  "event-134371016.09": "And when Deference mind's connects with the AI of the Starship of the Nova-Br0, you state that she becomes one with the hive mind.#$b#She could now see and understand everything in the Universe.",
  "event-134371016.10": "Yes...",
  "event-134371016.11": "So, when she pilots her ship through the Desty wormhole to send the neutrino-bomb away from the Skweak system and everyone is sad she died... How can they be sure?",
  "event-134371016.12": "What do you mean?",
  "event-134371016.13": "Well... you never actually say if the Nova-Br0 AI tried to reach her.#$b#Right after she crossed the wormhole, she could have ditched the bomb, flew through the wormhole again, which could lead her anywhere, yes, but she could communicate with the AI to tell her location.",
  "event-134371016.14": "I...",
  "event-134371016.15": "That's...",
  "event-134371016.16": "Listen here you little punk. I'm a professional writer! When she went through that wormhole, Deference was vaporized by the neutrino-bomb. End of story!",
  "event-134371016.17": "Okay. Pity, I liked her. Well nice talk. See you round, Mr. O'Brien.",
  "event-134371016.18": "That kid...",
  "event-134371016.19": "Wait, he may be onto something...",
  //Fievel Event - Added in 1.0.8
  "event-134371018.01": "WHAT'S ALL THAT RACKET?", //Added in 1.0.8
  "event-134371018.02": "IF I CATCH ONE OF THOSE DAMN CRABS AGAIN!$5", //Added in 1.0.8
  "event-134371018.03": "Hello! My name is Fievel, nice to meet you!$1", //Added in 1.0.8
  "event-134371018.04": "Eek, a giant talking mouse!$8", //Added in 1.0.8
  "event-134371018.05": "I'm a giant? That's neat!$1", //Added in 1.0.8
  //5 hears event - added in 2.0.0
  "event-134371004.01": "What a mess.", 
  "event-134371004.02": "Hey! Please come in.", 
  "event-134371004.03": "Yeah, this place is a dump.$2#$b#I didn't exactly plan to move in the Valley in advance. When I bought this place, I emptied my house into a truck and here I was!$1", 
  "event-134371004.04": "So... yeah.", 
  "event-134371004.05": "You really have a lot of useless junk.", 
  "event-134371004.06": "That's a lot... Do you need any help?", 
  "event-134371004.07": "I really do...#$b#But fear not, for I have devised the most ingenious solution to this hoarding problem!$1", 
  "event-134371004.08": "That's really kind of you to ask, @, but no. I have devised the most ingenious solution to this hoarding problem.$1", 
  "event-134371004.09": "I'm gonna set up a ledger upstairs so you can buy some of this stuff. It's a bit of everything, including some promotional material from my publisher.", 
  "event-134371004.10": "So you want to sell me your old stuff?", 
  "event-134371004.11": "Do you have money trouble, Rodney?", 
  "event-134371004.12": "What? No!$8#$b#Well, yes, but it's not for me! I'll give all the money I make from this to Gunther to fund the Library's educational programs!", 
  "event-134371004.13": "No.$7#$b# I'll give all the money I make from this to Gunther to fund the Library's educational programs!", 
  "event-134371004.14": "I'll set up the ledger very soon, now if you'll excuse me, I still have some work to do down here!$1", 
  "event-134371004.15": "You can leave now.", 
  //Post Special Order event - added in 2.0.0
  "event-134371019.01": "That's absolutely perfect, Robin!$1", 
  "event-134371019.02": "Impeccable craftsmanship.", 
  "event-134371019.03": "Thank you both! I love how it turned out. It's more enjoyable than I thought to work on such a small project!$1#$b#Oh, hey @!", 
  "event-134371019.04": "@! I'm glad you're here. What do you think of the new mini-library?$1", 
  "event-134371019.05": "It's simple. In this beautiful and very cute mini-library, you can trade those autographed photos of me for books!$1#$b#Most of these books come from my personal collection. People can drop those photos so I can recycle them and in exchange, they get a book. Everybody wins!$1", 
  "event-134371019.06": "By the way Rodney, why is there so many autographed photos of you everywhere in the Valley?", 
  "event-134371019.07": "That's a bit embarrassing.$2#$b#When I moved to the Valley and started writing again, my publisher had all these photos of me printed because he believed I was on the verge on publishing a new book and he wanted to give me some exposure.#$b#Pretty standard marketing right? Then, and this is the embarrassing part, the plane that was shipping thousands of photos of me had a mishap with its hold.#$b#The cargo wasn't very well secured either and one night, it rained photos of me everywhere in the area.", 
  "event-134371019.08": "My publisher hasn't done anything to fix it and the shipping company went bankrupt. So I'm doing what I can to help.", 
  "event-134371019.09": "That's not supposed to be a funny story!$8", 
  "event-134371019.10": "I'm sorry, Rodney, but it is!$1#$b#I can't stop picturing the night sky full of photos of you!$1", 
  //Dating proposal
  "event-134371020.01": "Hello @.", 
  "event-134371020.02": "Say, I have been meaning to ask you something for a while and...#$b#Dear Yoba, this is so embarrassing.$2", 
  "event-134371020.03": "Do you think you and I should be more than friends?", 
  "event-134371020.04": "I would like that a lot. (ROMANTIC)", 
  "event-134371020.05": "I don't see you as more than a friend, Rodney. (PLATONIC)", 
  "event-134371020.06": "Oh.$8#$b#Well, that's even more embarrassing.$2#$b#Well, let's just pretend this never happened and be on our merry way!$1#$b#See you around town, farmer!", 
  "event-134371020.07": "That's marvelous!$1#$b#Since I'm a gentleman, I'd like to take you out on a proper date!#$b#Meet tonight in East Scarp after 10pm, okay?#$b#I'm looking forward to it!$1", 
  //Dating beach Event - Added in 2.0.0
  "event-134371021.01": "You came!$1", 
  "event-134371021.02": "I found the perfect spot for our date. I don't go there often because it's not really easy to access, but you are worth it.$4",
  "event-134371021.03": "Follow me!",
  "event-134371021.04": "Almost there!",
  "event-134371021.05": "Here we are, at last!",
  "event-134371021.06": "So, what do you think? Gus made us some delicious food and helped me carry everything here earlier, including the table!$1",
  "event-134371021.07": "Do you like it?",
  "event-134371021.08": "It's gorgeous, I love it!",
  "event-134371021.09": "It's really nice.",
  "event-134371021.10": "Not as gorgeous as you, sweetie.$4",
  "event-134371021.11": "Not as nice as you, sweetie.$4",
  "event-134371021.12": "Come on, the view is stunning.",
  "event-134371021.13": "I'm so glad I'm able to share this place with you, sweetie.",
  "event-134371021.14": "You know, I...#$b#I haven't felt this way in years, @. And truth be told, I didn't expect to feel like this again. I'm an old man and I genuinely believed love and passion were in my past.#$b#But when, I look at you, I just...#$b#%Rodney's biting his lower lips while looking at you.",
  "event-134371021.15": "My sweet farmer.",
  "event-134371021.16": "I'm gonna kiss you now.$4",
  "event-134371021.17": "I can't believe I'm dating Rodney! Life is full of surprises.",
  //Breakfast date
  "event-134371022.01": "Good morning beautiful!", 
  "event-134371022.02": "I woke up early so I'm making us some breakfast!$1", 
  "event-134371022.03": "I...$2#$b#Okay, if you were wondering, I need to tell you that I don't ever want to get married again.$2#$b#Don't me wrong, I love you and I want to be with you, but I have already done marriage, you know? And it's not what I want for the future.$2#$b#You don't have to say anything, okay? I just needed to get it out there now that we have been dating for a while.#$b#The last few weeks have been wonderful and I hope we have many more to come.$1.#$b#I love you so much, my sweet @.$4", 
  "event-134371022.04": "So, we're good, right?", 
  "event-134371022.05": "Of course we are!", 
  "event-134371022.06": "Yes. And about that breakfast?", 
  "event-134371022.07": "This makes me very happy.$4", 
  "event-134371022.08": "What?$8#$b#Oh yeah, of course! Well, I'm glad we're okay.", 
  "event-134371022.09": "So, how do you like your eggs?", 

  //Rodney's autograph name for fishing
  "AutographName": "An autographed photo",
  // MEEP Component
  // TAROT CARDS 
  "TarotCard.00": "You picked The Fool. The drawing is weirdly familiar. The Fool symbolizes innocence and unlimited potential.",
  "TarotCard.01": "You picked The Magician. It stands for resourcefulness, power and inspired action.",
  "TarotCard.02": "The Arcana of The High Priestess symbolizes the divine feminine, intuition and spirituality.",
  "TarotCard.03": "The Empress stands for femininity, beauty, nature, nurturing and abundance. It's the traditional motherly figure.",
  "TarotCard.04": "The Emperor is the symbol of authority, establishment and structure.",
  "TarotCard.05": "The Hierophant represents spiritual wisdom, conformity, tradition and institution.",
  "TarotCard.06": "The Arcana of the Lovers symbolizes love, of course, but also harmony, values alignment and relationships, romantic or platonic.",
  "TarotCard.07": "You picked The Chariot. It symbolizes control, willpower, success, action and determination.",
  "TarotCard.08": "You picked Strength. It is associated with strength, courage, persuasion and influence, but also with compassion.",
  "TarotCard.09": "The Arcana of The Hermit stands for being alone, introspection and relying on inner guidance.",
  "TarotCard.10": "You picked The Wheel Of Fortune. This arcana represents good luck, karma, life cycle, destiny and a turning point.",
  "TarotCard.11": "You picked Justice. It symbolizes justice, of course, but also fairness, truth, cause and effect, and the law.",
  "TarotCard.12": "The Arcana of The Hanged Man stands for pause, surrender, letting go and new perspectives.",
  "TarotCard.13": "You have picked Death. Death is the Arcana of ending, but also change, transformation and transition.",
  "TarotCard.14": "Temperance stands for balance, moderation, patience and purpose.",
  "TarotCard.15": "You drew The Devil. This Arcana represents the shadow self, attachment, addiction, restriction and sexuality.",
  "TarotCard.16": "The Tower represents a sudden change, an upheaval, chaos, revelation or an awakening.",
  "TarotCard.17": "The Arcana of The Star is all about hope, faith, purpose, renewal and spirituality.",
  "TarotCard.18": "You picked The Moon. It is associated with illusion, fear, anxiety, subconscious and intuition.",
  "TarotCard.19": "The Sun stands for positivity, fun, warmth, success and vitality.",
  "TarotCard.20": "The Arcana of Judgment symbolizes rebirth, inner calling and absolution.",
  "TarotCard.21": "The World is the last of the major arcanas. It symbolizes completion, integration, accomplishment and also travel.",
  //Photo 
  "WeddingPhoto": "There is a note below the frame: Annwenn & Rodney's wedding day.",
  //Notes 
  "MEEP-Board": "This board is covered it notes. They don't make much sense to you:^^Is there a magic child in town? OR TWO???^^Is Sebastian a vampire?^^Remember to buy some vinegar.^^Deference Arlington, volume 15: An Admiral Lost In Space.",
  //Config menu
  "config.EnableAutograph.name": "EnableAutograph",
  "config.EnableAutograph.description": "Allows Rodney's autographed photo to spawn in the water and sometimes in artifact spots. Disable if you hate fun.",
  "config.section.Autograph Spawning.name": "Autograph Spawning",
  //Special order - added in 2.0.0
  "Quests.Rodney.SpecialOrders.AutographCleanup.Name": "Autograph clean-up", 
  "Quests.Rodney.SpecialOrders.AutographCleanup.Text": "Promotional photos of myself have been polluting the Valley. Please deliver some to my house so I can have them properly recycled.     -Two-time award winner, author Rodney O'Brien.", 
  "Quests.Rodney.SpecialOrders.AutographCleanup.Objective.0.Text": "Deliver 30 autographed photos of Rodney to the drawer in his kitchen.", 
  //Dating - added in 2.0.0
  "give_pendant": "I'm flattered, I really am, but...$2#$b#I don't think I want to get married again. I hope you're not mad, sweetie.$2#$b#$Rodney gives you a loving hug.", 
  "pendant_reject": "I don't want to get married again, you already know that right?$2", 
  "bouquet_reject": "I do like flowers, but when I want us to be more serious, I'll let you know.", 
  //Romantic 10H dialogue - added in 2.0.0
  "spring_Mon10.Romantic": "The kids at the library said you should be hiding me in town for the Egg Festival...#$b#Because my head looks like a giant egg!$1#$b#Ah, kids. So cute, yet so stupid.", 
  "spring_Tue10.Romantic": "Hello sweetie! You'll never guess what I discovered last night. You remember my magical girl novel? Arcana Catcher:Prunus?#$b#Well, turns out despite its failure at launch, it gained some popularity online. People are writing fanfictions and cosplaying as Prunus! They call themselves the Arcanists!$1#$b#That's so cool! I may need to establish a social media presence to engage with them.",  
  "spring_Wed10.Romantic": "You know sweetie, I'm really grateful for Joja...#$b#Well, without that awful job you used to have there, you would probably never have moved to the Valley and we never would have met...$2#$b#I'm so glad I met you.$4", 
  "spring_Thu10.Romantic": "Hey sweetie, do you know what happens when you don't pay your exorcist?#$b#You get repossessed!$1#$b#Get it?#$b#Although, I may need an exorcist myself because you are looking hauntingly beautiful.$4", 
  "spring_Fri10.Romantic": "Yesterday, I watched a documentary about the Fern Islands and now, I really want to visit again.$2#$b#Last time I went was on spring break when I was a student.#$b#We should go on a romantic getaway there! Just you, me, enjoying the tropical lifestyle in our bathing suits...$4", 
  "spring_Sat10.Romantic": "You know, sweetie, if I were to rate you on a scale of 1 to 10, I'd say you're a 9.#$b#And I'm the 1 you need!$1", 
  "spring_Sun10.Romantic": "Hello sweetie. Say, are you JojaPrime Video?#$b#Because I could lay down and watch you for hours.$4",  
  "summer_Mon10.Romantic": "Abigail is so fun to be around. I love how she keeps talking about eating rocks.#$b#That's why she reminds me so much of the King Of Wands.$3#$b#This tarot arcana is about energy, passion, adventure and impulsiveness. I mean, that's pretty much Abigail!$3", //no change from regular dialogue
  "summer_Tue10.Romantic": "Do you know how I got the idea for Meredith's name?#$b#You'll never guess!$1#$b#My parents were supposed to have a daughter instead of me and had already chosen the name Meredith for me.$1#$b#They almost named me Meredith but finally settled for Rodney. Naming my daughter Meredith was a nice callback and my parents loved it.$1",  
  "summer_Wed10.Romantic": "I haven't published much these past fifteen years and I know some people from my old life are worried about it.#$b#I have enough money to live a comfortable life here and I take pride in the fact that the acquisition of wealth is no longer the driving force of my life.$1#$b#I'm happy that I work to better myself and hopefully the rest of humanity.", //no change from regular dialogue
  "summer_Thu10.Romantic": "After careful consideration, I've decided which tarot arcana suits Leah the best.$3#$b#She's the Knight of Cups!$3#$b#This arcana is about creativity, charm, beauty and imagination. If fits her personality so well.$3", //no change from regular dialogue
  "summer_Fri10.Romantic": "Hey sweetie! Do you likes sales?#$b#Because clothing is 100% off at my place.$4", 
  "summer_Sat10.Romantic": "One of these nights, we should go on a movie date!#$b#Oh shoot, I remember I'm not allowed to take you to the movie theater!$8#$b#They don’t let you bring in your own snacks.$4", 
   "summer_Sun10.Romantic": "You know farmer @, you did a great job on %farm Farm.#$b#I mean, you left an awful corporate job and turned an abandoned farmland into a thriving farm.#$b#I read somewhere that when we hit our lowest point, we are open to the greatest change.#$b#It made me think of you.$1",
  "fall_Mon10.Romantic": "Oh no, sweetie! You have something on your butt!$8#$b#It's my eyes.$4", 
  "fall_Tue10.Romantic": "I do my best to be supportive of Elliott's writing, because his parents don't really believe he can make it as writer.$2#$b#He thinks he can do it all alone, and to be honest, he probably can.#$b#While it is always best to believe in oneself, a little help from others can be a great blessing.$1#$b#And I should know, I wouldn't be where I am today without your support, sweetie.$4", 
  "fall_Wed10.Romantic": "I don't really get how Elliott is fine with living on a derelict shed on the beach. That kid has such a magnetic personality and yet, he choses to hide from the world.$2#$b#That's why he reminds me of The Hermit.$3#$b#This arcana is perfect to describe someone who enjoys being alone and relies on introspection and inner guidance.$3", //no change from regular dialogue
  "fall_Thu10.Romantic": "You changed a lot since you arrived in the Valley, sweetie. I'm sure your grandfather would be very proud of what you accomplished on %farm farm. I sure am proud of you!", 
  "fall_Fri10.Romantic": "Now that I've started writing again, I have so many ideas!$1#$b#Those short stories inspired by life in Stardew Valley gave me some new ideas. I would love to write a novel about the Dwarves.#$b#Apparently they referred to themselves as Sky People. Now that would make some quality science fiction!$1", //no change from regular dialogue
  "fall_Sat10.Romantic": "You know what it is...$4#$b#It's tarot time!$3#$b#$y 'Which tarot arcana matches granny Evelyn personality?_The Queen Of Cups_Wrong! The Queen Of Cups is about someone who shows compassion, warmth and kindness while acting as a counselor. It's better suited to Marnie!$3_The King Of Swords_That is correct! The King Of Swords represents mental clarity, intellectual power, authority and truth. I can't think of a tarot arcana more appropriate for her!$3", //no change from regular dialogue
  "fall_Sun10.Romantic": "Oh, there you are sweetie! You always so busy. Aren't you tired of running through my mind?$4",  
  "winter_Mon10.Romantic": "I'm very proud of Meredith.#$b#She accomplished so much and she's not even thirty years old!#$b#When I was her age, I was still working odd jobs in Zuzu City by day and writing at night.#$b#I can't wait to see what she does next.$1",//no change from regular dialogue
  "winter_Tue10.Romantic": "I was walking on the beach last week and I tripped on a book!#$b#A library book! Buried in the snow!$5#$b#I'm so glad Gunther replaced the previous librarian, that one didn't know how to care of his book collection!",//no change from regular dialogue
  "winter_Wed10.Romantic": "Tell me sweetie...#$b#Have I ever told you that on Wednesdays, I wear pink?$1#$b#Oh! You should do it as well and we could be The Pink Wednesday Lovers!$1", 
  "winter_Thu10.Romantic": "I'm really grateful for my life here. I enjoy walking around East Scarp, the neighbors are friendly, I can see Elliott almost everyday and it's always a pleasure when Meredith visits!#$b#And I have you to be thankful for as well, my sweet @.$4", 
  "winter_Fri10.Romantic": "You know sweetie, when I first met you, I thought you were pretty dumb and rude.$2#$b#I've never been so wrong! You're smart, gentle and, quite frankly, drop-dead gorgeous.$1", 
  "winter_Sat10.Romantic": "Hello sweetie! There's a new episode of Stellar Gallivant: Uncovering airing tomorrow night!$1#$b#What about Joja Prime Video and chill at my place?$4", 
  "winter_Sun10.Romantic": "I have been wanting to have a little garden near my house for while. I could ask Aideen about planting some tulips.#$b#Then, I'd put your tulips and my tulips together.$4",

  //Locations name //added in 3.0.0
  "MapName.ESRodneysHouse": "Rodney's House", //added in 3.0.0
  "MapName.ESRodneysBasement": "Rodney's Basement", //added in 3.0.0
  "MapName.ESFerngillNationalLibrary": "Ferngill National Library", //added in 3.0.0
  "MapName.ESLibraryExterior": "Ferngill National Library's Park", //added in 3.0.0

  //Shops //added in 3.0.0
  "WWWA.RodneyLedger.message": "My shop has wares, if you have coin.",  //added in 3.0.0
  "WWWA.Bookexchange.message": "Exchange your autographed photos for books!", //added in 3.0.0
  "WWWA.Marketpalooza.message": "Shop for charity!", //added in 3.0.0

  //1.6 dialogue strings: 
  "Rodney.DumpsterDiveComment": "Uh, you okay @? Need some help?$2", //added in 3.0.0
  "Rodney.HitBySlingshot": "Who do you think you are to attack two-time award winner, author Rodney O'Brien?$5", //added in 3.0.0

  //Custom items //added in 3.0.0
  //Note for translators: most of these items were moved from the JsonAssets pack so you can just port the translation. New items have a comment saying added in 3.0.0
  //Scarecrows
  "WWWA.RodneyBeachOutfitScarecrow": "Rodney Beach Outfit",
  "WWWA.RodneyBeachOutfitScarecrow.Description": "A cardboard cutout of Rodney wearing a beach outfit. It can probably work as a scarecrow.",
  "WWWA.RodneyCosplayScarecrow": "Rodney Cosplay",
  "WWWA.RodneyCosplayScarecrow.Description": "A cardboard cutout of Rodney wearing a cosplay of Captain Pierre-Jean Breton from Stellar Gallivant: The Second Genesis. It can probably work as a scarecrow.",
  "WWWA.RodneyEggFestivalScarecrow": "Rodney Egg Festival",
  "WWWA.RodneyEggFestivalScarecrow.Description": "A cardboard cutout of Rodney wearing an egg hat. It can probably work as a scarecrow.",
  "WWWA.RodneySummerOutfitScarecrow": "Rodney Summer Outfit",
  "WWWA.RodneySummerOutfitScarecrow.Description": "A cardboard cutout of Rodney wearing his signature Summer pink outfit. It can probably work as a scarecrow.",
  "WWWA.RodneyWinterStarScarecrow": "Rodney Winter Star",
  "WWWA.RodneyWinterStarScarecrow.Description": "A cardboard cutout of Rodney wearing a Winter Star outfit. It can probably work as a scarecrow.", 
  //Autographs
  "WWWA.AutographedPhoto": "An autographed photo",
  "WWWA.AutographedPhoto.Description": "An autographed photo of two-time award winner, author Rodney O'Brien.",
  "WWWA.GenuineAutograph": "A genuine autograph",
  "WWWA.GenuineAutograph.Description": "This looks like an original autographed photo of two-time award winner, author Rodney O'Brien.",
  //Books
  "WWWA.Book.ArcanaCatcherPrunus": "Arcana Catcher Prunus",
  "WWWA.Book.ArcanaCatcherPrunus.Description": "A novel about a young girl who captures magical tarot cards to save her father, by Rodney O'Brien.",
  "WWWA.Book.ArtifactOrCutlery": "Artifact or cutlery",
  "WWWA.Book.ArtifactOrCutlery.Description": "A guide for the scholar to distinguish a genuine artifact from old and rusty cutlery, by Gunther.",
  "WWWA.Book.CrabsAndWhyIHateThem": "Crabs and Why I Hate Them",
  "WWWA.Book.CrabsAndWhyIHateThem.Description": "The Collective Works of Dr Mateo Luis ft. Zuzu City Times Bestseller, 'Crabs, and Why I Hate Them.'",
  "WWWA.Book.DeferenceArlington": "Deference Arlington The Complete Saga",
  "WWWA.Book.DeferenceArlington.Description": "The Complete Deference Arlington Saga (Volumes 1 to 14), an epic space opera series by Rodney O'Brien.",
  "WWWA.Book.FishingForDumbDumbs": "Fishing for dumb dumbs",
  "WWWA.Book.FishingForDumbDumbs.Description": "A guide for the amateur angler.",
  "WWWA.Book.GettingChicksToLoveYou": "Getting Chicks To Love You",
  "WWWA.Book.GettingChicksToLoveYou.Description": "Tips and tricks for raising chickens, by Shane.",
  "WWWA.Book.Goblins": "Goblins",
  "WWWA.Book.Goblins.Description": "A book about the species commonly known as 'Goblin', by M.Jasper.",
  "WWWA.Book.GuideToSculptingWithGold": "Beginner's guide to sculpting with gold",
  "WWWA.Book.GuideToSculptingWithGold.Description": "A guide to getting started with sculpting gold statues, by Mayor Lewis.",
  "WWWA.Book.HerpetologyOfFerngill": "Herpetology of Ferngill",
  "WWWA.Book.HerpetologyOfFerngill.Description": "A publication about the many reptiles and amphibians of the Ferngill Republic, by Nora Chambers.",
  "WWWA.Book.LunarkinTrollTales": "Lunarkin Troll Tales Book One",
  "WWWA.Book.LunarkinTrollTales.Description": "The first installment of the critically acclaimed children's book series by author Vivienne Trenton.",
  "WWWA.Book.MysteriesOfTheDwarves": "Mysteries of the Dwarves",
  "WWWA.Book.MysteriesOfTheDwarves.Description": "A book compiling the research of M.Jasper about the Dwarves, also known as the Smoluanu.",
  "WWWA.Book.PepperRexes": "Pepper Rexes",
  "WWWA.Book.PepperRexes.Description": "Peper Rexes, What they are, and where they've come from: A research paper about the mighty Pepper Rexes, by Dr Mateos Luis.",
  "WWWA.Book.TheBookOfYoba": "The Book Of Yoba",
  "WWWA.Book.TheBookOfYoba.Description": "A religious book about the creation of the world.",
  "WWWA.Book.TheGreatBookOfSlimes": "The Great Book Of Slimes",
  "WWWA.Book.TheGreatBookOfSlimes.Description": "An adventurer's guide on how to approach, fight and raises slimes.",
  "WWWA.Book.TheGreatTomeOfMayo": "The Great Tome of Mayonnaise",
  "WWWA.Book.TheGreatTomeOfMayo.Description": "Are the pages covered in mayonnaise???",
  "WWWA.Book.TheJojaConspiracy": "The Joja Conspiracy",
  "WWWA.Book.TheJojaConspiracy.Description": "An anonymous author makes some very serious accusations against JojaCorp.",
  "WWWA.Book.TheTarotRevealed": "The Tarot Revealed",
  "WWWA.Book.TheTarotRevealed.Description": "A complete guide to the Ferngill-O'Brien-Smith Tarot by Edwina O'Brien.",
  "WWWA.Book.WhyPepperRexesAreTheBest": "Why Pepper Rexes are the Best",
  "WWWA.Book.WhyPepperRexesAreTheBest.Description": "When the Pepper Rex goes Zoom Zoom it makes my Heart go Boom Boom: An Essay on why Pepper Rexes are the Best, by Dr Mateos Luis.",
  //Hats
  "WWWA.PrunusCrown": "Prunus Crown",
  "WWWA.PrunusCrown.Description": "An official replica of the Crown worn by Arcana Catcher Prunus in a novel by author Rodney O'Brien.",
  "WWWA.EggHat": "Egg Hat",
  "WWWA.EggHat.Description": "Vincent made this hat. Can't you tell?",
  "WWWA.PinkSummerHat": "Pink Summer Hat",
  "WWWA.PinkSummerHat.Description": "Rodney has the exact same hat.",
  "WWWA.WinterStarHat": "Purple Winter Star Hat", //added in 3.0.0
  "WWWA.WinterStarHat.Description": "A very fashionable hat to keep your head warm and look handsome for the Feast Of The Winter Star.", //added in 3.0.0

  //Items category override //added in 3.0.3
  "Items.AutographedPhoto.Category": "Promotional material",
  "Items.GenuineAutograph.Category": "Rare collectible",
  //Mail //added in 3.0.0
  //Note for translators: all these letters were moved from the Mail Framework Mod pack so you can just port the translation.
"Mail.RodneyBookLaunchInvite": "^My dear @,^My book, The Chronicles of Stardew Valley, is getting officially released soon! I'd like to invite you, along with a couple of very dear friends to a little shindig at the Stardrop Saloon next Friday! Be there by 7 pm, okay?^Dress code is smart casual. I hope to see you there.^Your friend, Rodney O'Brien.^ ^ ^^^^PS: My publisher printed these pictures to promote the book and I don't know what do with them so have a few of them.%item object (O)WWWA.AutographedPhoto 10 %%[letterbg Mods/TheFrenchDodo.RodneyOBrien/LetterBackgrounds 0][textcolor black][#]An invitation from Rodney O'Brien",
  "Mail.RodneyLibraryTalkInvite": "^Dear @,^Would you meet me at the library at your earliest convenience? There is a thing I'd like to talk about with all my friends!^Your friend, Rodney O'Brien.^PS: I have a box of these photos at home and I don't know what to do with it, so here you go.%item object (O)WWWA.AutographedPhoto 20 %%[letterbg Mods/TheFrenchDodo.RodneyOBrien/LetterBackgrounds 0][textcolor black][#]Meet me at the Library",
  "Mail.RodneyNationalLibraryInvite": "My dear friend @,^as promised here are the details concerning the public reading I will be doing at the Ferngill National Library.^The event will happen tomorrow afternoon. We'll need to leave early to go to Zuzu City by bus. Meet me at the bus stop before 10 am, okay?^I look forward to seeing you there.^Your friend, Rodney O'Brien.^PS: I really don't know what to do with these, so here, have a few!%item object (O)WWWA.AutographedPhoto 40 %%[letterbg Mods/TheFrenchDodo.RodneyOBrien/LetterBackgrounds 0][textcolor black][#]Let's visit the National Library",
}
/* ++ edit festival dialogue for romance. 
same for gift reactions, movies

I hate to see you go, but I love to watch you leave 
""
“” */